[
    {
        "title": "Serena Williams’ Five-Year-Old Daughter’s Accidental Taylor Swift Discovery Leaves Father Alexis Ohanian Beaming With Pride as He Shares Exciting News",
        "description": "The ‘Queen of the Court,’ Serena Williams has long been a part of the renowned American singer Taylor Swift’s fandom. Her fangirl moment was quite evident in 2015 when the former tennis ace attended the pop sensation’s concert in London. The WTA legend and her celeb friends, Kendall Jenner and Gigi Hadid present at Hyde…The post Serena Williams’ Five-Year-Old Daughter’s Accidental Taylor Swift Discovery Leaves Father Alexis Ohanian Beaming With Pride as He Shares Exciting News appeared first on EssentiallySports."
    },
    {
        "title": "Behind the Meaning of “You’re On Your Own Kid” by Taylor Swift",
        "description": "“You’re On Your Own Kid” has become a fan favorite since Taylor Swift released it as part of Midnights in 2022. The song likely connects with Swifties because of its personal meaning to Swift. Her fans are more like close friends of the singer-songwriter. Swift’s wins are theirs to celebrate as well. Her losses are […]The post Behind the Meaning of “You’re On Your Own Kid” by Taylor Swift appeared first on American Songwriter."
    },
    {
        "title": "Why I drove from Salt Lake City to watch a Taylor Swift concert",
        "description": "Taylor Swift performs during “The Eras Tour,” Monday, Aug. 7, 2023, at SoFi Stadium in Los Angeles. Chris Pizzello, Invision, Associated Press Anyone who knows me knows that I’m a huge Taylor Swift fan, or “Swiftie,” as her fans have dubbed themselves. On Wednesday night, she completed the last show of her American tour in 2023. Tuesday night, I made the impulsive and somewhat irrational decision to hop into my little Chevrolet Cruze and drive by myself down to Los Angeles to see if I could get tickets for the show.My journey to Los Angeles was full of different roadblocks — such as..."
    },
    {
        "title": "Taylor Swift Receives a Special Applause From Dave Portnoy as the Barstool Sports Owner Announces Massive Update",
        "description": "This week saw Dave Portnoy regain his power position and add his absolute favorite merch to the store. Having Massachusetts roots the businessman, blogger, and social media star is always lying on the headlines for his actions. In certain instances, his million-dollar company, Barstool Sports, or popular Hollywood celebrities’ hangouts have garnered headlines. If the…The post Taylor Swift Receives a Special Applause From Dave Portnoy as the Barstool Sports Owner Announces Massive Update appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift’s “Cruel Summer” Approaching #1 On Hot Adult Contemporary Radio Chart",
        "description": "Already a #1 hit at pop radio, Taylor Swift’s “Cruel Summer” is approaching the peak position at the hot adult contemporary format. It could get there as soon as this week. “Cruel Summer” received 1,548 spins during the first two days of the August 13-19 tracking period. The count tops the same-time-last-week mark by a […]The post Taylor Swift’s “Cruel Summer” Approaching #1 On Hot Adult Contemporary Radio Chart appeared first on Headline Planet."
    },
    {
        "title": "2 Days After Taylor Swift Discovery, Serena Williams’ Five-Year-Old Grown-Up Daughter Cruises in Vintage Mode As Father Alexis Ohanian Shares Quirky Update",
        "description": "Serena Williams‘ daughter, Alexis Olympia Ohanian Jr., is a miniature image of her mother. Starting from her interest in the sporting world to sharing the same kind of hobbies and likes. Plus, as you all know, the 41-year-old American tennis legend is a die-hard Swiftie and has long been a part of her fans’ lives.…The post 2 Days After Taylor Swift Discovery, Serena Williams’ Five-Year-Old Grown-Up Daughter Cruises in Vintage Mode As Father Alexis Ohanian Shares Quirky Update appeared first on EssentiallySports."
    },
    {
        "title": "Chris ‘Mad Dog’ Russo: ‘I don’t care if Taylor Swift is nude in the box,’ still not interested in Travis Kelce romance",
        "description": "Look somewhere else besides Chris “Mad Dog” Russo for takes on Travis Kelce and his romance with Taylor Swift. The longtime radio provocateur made it known early in his show on Monday that he will not be participating in the sports media discourse of the moment, saying, “I don’t care if Taylor Swift is nude Read more...The post Chris ‘Mad Dog’ Russo: ‘I don’t care if Taylor Swift is nude in the box,’ still not interested in Travis Kelce romance appeared first on Awful Announcing."
    },
    {
        "title": "A Guide to Taylor Swift’s Alleged New Boyfriend Travis Kelce for Swifties Who Never Watch Football",
        "description": "For starters, he’s a top tight end."
    },
    {
        "title": "Travis Kelce jersey sales skyrocket after Taylor Swift attends Chiefs vs. Bears game",
        "description": "Kelce and Swift are becoming a power couple, and that is good for the NFL's overall business."
    },
    {
        "title": "Taylor Swift Helps Bump Sales of Travis Kelce’s Jersey by 400 Percent",
        "description": "Taylor Swift has already conquered the realms of recorded and live music as well as cinema. Now she’s going after sports. After appearing at an NFL game ostensibly to root for rumored beau Travis Kelce and his Kansas City Chiefs over the weekend, sales of the tight end’s jersey are up a reported 400 percent, […]The post Taylor Swift Helps Bump Sales of Travis Kelce’s Jersey by 400 Percent appeared first on American Songwriter."
    },
    {
        "title": "Sports radio legend uninterested in Taylor Swift-Travis Kelce drama, not even if she's 'nude in the box'",
        "description": "Sports radio legend Christopher \"Mad Dog\" Russo, during a radio rant Monday, was uninterested in what Taylor Swift and Travis Kelce were doing."
    },
    {
        "title": "As Taylor Swift Headlines Arrowhead, Travis Kelce’s 2100 Plus Days Patience for a Kiss Finally Turning Into Reality",
        "description": "Seems like Travis Kelce’s years ago dream of kissing Taylor Swift is manifesting. After marking her presence at Arrowhead Stadium for the game between the Kansas City Chiefs and the Chicago Bears, Swift had a late-night dinner with Travis Kelce alongside his family and teammates. But in a recent turn of events, an old wish…The post As Taylor Swift Headlines Arrowhead, Travis Kelce’s 2100 Plus Days Patience for a Kiss Finally Turning Into Reality appeared first on EssentiallySports."
    },
    {
        "title": "Power Couple Patrick Mahomes And Brittany Gets Dwarfed By NFL’s Love Birds Travis Kelce And Taylor Swift in 48 Hours",
        "description": "Step aside Patrick and Brittany Mahomes. We’ve got a new power couple in the making and they’re ready to conquer both the stage and the gridiron! In a thrilling showdown at the Kansas City Chiefs’ clash of titans against the Chicago Bears, Taylor Swift answered the call of rumored beau Travis Kelce and witnessed his…The post Power Couple Patrick Mahomes And Brittany Gets Dwarfed By NFL’s Love Birds Travis Kelce And Taylor Swift in 48 Hours appeared first on EssentiallySports."
    },
    {
        "title": "After Declaring ‘Lfg’ Travis Kelce Is the ‘Right Guy’ for Taylor Swift, Pat McAfee Swiftly Shoots Three-Word Message",
        "description": "Pat McAfee and ESPN Personality think that the Kansas City Chiefs will win the Super Bowl again and this time it’s not because of their head trainer Andy Reid, quarterback Patrick Mahomes, or tight end Travis Kelce. The one responsible for their fourth Lombardi jewel coming to Kansas City will be Taylor Swift. Yes, you…The post After Declaring ‘Lfg’ Travis Kelce Is the ‘Right Guy’ for Taylor Swift, Pat McAfee Swiftly Shoots Three-Word Message appeared first on EssentiallySports."
    },
    {
        "title": "Sports radio legend uninterested in Taylor Swift-Travis Kelce drama, not even if she’s ‘nude in the box’",
        "description": "Sports radio legend Christopher \"Mad Dog\" Russo just wanted to watch the Kansas City Chiefs take on the Chicago Bears without the spectacle of Taylor Swift being at the game.Swift has been at the forefront of the NFL world amid rumors that she and Travis Kelce are dating. Nothing has been confirmed on that end, though they did not exactly put anything to rest when the two left Arrowhead Stadium together.CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\"I’m not into Taylor Swift and Travis Kelce so try somebody else for that,\" Russo said Monday on \"Mad Dog Unleashed.\"\"I could care less. I don..."
    },
    {
        "title": "Travis Kelce’s ex issues a warning to Taylor Swift amid romance rumors",
        "description": "If you ask Travis Kelce’s ex-girlfriend, Taylor Swift should tread very lightly in her rumored new relationship. The rumor mill has been abuzz in recent days after Taylor was spotted cheering on Travis’s team, The Kansas City Chiefs, alongside his mom, Donna, and walking the tunnel with him post-game. Many"
    },
    {
        "title": "Right-wing pundit Mark Hemingway SLAMS Taylor Swift's music, saying it tells women it's okay to be 29, unmarried and childless",
        "description": "In an essay for The Federalist, Mark Hemingway criticized Taylor Swift's music for promoting a culture of self-obsession. He said her songs are about breakups and can be too obvious."
    },
    {
        "title": "Travis Kelce teases personal life talk in new podcast trailer amid Taylor Swift drama: ‘I did this to myself’",
        "description": "Travis Kelce appears set to break his silence on his link to Taylor Swift after she appeared at the Kansas City Chiefs game against the Chicago Bears on Sunday, setting the sports world on fire.Kelce, and his brother Jason, dropped the trailer for his the latest episode of their podcast \"New Heights.\" The trailer begins with the Philadelphia Eagles center telling his brother that they have to talk about his personal life.\"Yeah, my personal life that’s not so personal. I did this to myself, Jason. I know this,\" Travis said.CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\"Well Travis, how’s..."
    },
    {
        "title": "Will Taylor Swift Be At The Next Chiefs Game Vs. The Jets?",
        "description": "Getty Image Time will tell if Swift returns this Sunday."
    },
    {
        "title": "Travis Kelce notes Taylor Swift’s ‘bold’ appearance at Chiefs game but is mum about any relationship",
        "description": "Kansas City tight end Travis Kelce calls Taylor Swift’s appearance at the Chiefs’ victory over the Chicago Bears “pretty bold” but wants to remain private about any relationship with the superstar singer. Speaking on his podcast “New Heights with Jason and Travis Kelce” that premiered Wednesday morning, Kelce discussed Swift’s well-publicized appearance in a suite […]"
    },
    {
        "title": "Travis Kelce notes Taylor Swift’s ‘bold’ appearance at Chiefs game but is mum about any relationship",
        "description": "KANSAS CITY, Mo. (AP) — Travis Kelce called an appearance by Taylor Swift at the Kansas City Chiefs’ victory over…"
    },
    {
        "title": "Months After Bill Battle, Soon-to-Be Billionaire Taylor Swift Answers Underpaid TE Travis Kelce’s Ever-Lasting Emotions",
        "description": "The Kansas City vs. Chicago game will go down in NFL history not as a Chiefs domination, but as one of the most romantic games in its history. Lovebirds Taylor Swift and Travis Kelce dominated the screens while the Chiefs dominated the Bears on the field. But the love story has a twisted angle. Is…The post Months After Bill Battle, Soon-to-Be Billionaire Taylor Swift Answers Underpaid TE Travis Kelce’s Ever-Lasting Emotions appeared first on EssentiallySports."
    },
    {
        "title": "Good News Thursday: Dad of six gets free car after biking to work, Taylor Swifts’s The Eras Tour Concert Film is going global",
        "description": "Sacramento resident Isaac Taylor, father of six, got a free car after biking eight miles to and from work every day for the past six months. Taylor works a 10-hour graveyard shift before walking his young children to school. "
    },
    {
        "title": "California Governor Gavin Newsom Reckons The Taylor Swift And Travis Kelce Dating Rumors Are A Bigger Deal Than The GOP Debate",
        "description": "FOX Newsom also praised the impact Swift has had on voter registration, specifically among young people."
    },
    {
        "title": "13 Years After Breaking Up With Taylor Swift, Ex-Lover Becomes Best Boyfriend Candidate in the Eyes of Dave Portnoy",
        "description": "Taylor Swift and NFL tight end for the Kansas City Chiefs, Travis Kelce, have set the world abuzz with their recent appearances together. Swifties from all corners of the globe were sent into a frenzy when the renowned “Red” singer was spotted at Arrowhead Stadium during a Kansas City Chiefs game against the Chicago Bears.…The post 13 Years After Breaking Up With Taylor Swift, Ex-Lover Becomes Best Boyfriend Candidate in the Eyes of Dave Portnoy appeared first on EssentiallySports."
    },
    {
        "title": "Mark Cuban wants to introduce Taylor Swift to Mavericks players",
        "description": "If Taylor Swift's much-rumored romance with Kansas City Chiefs stud tight end Travis Kelce doesn't work out, there's one NBA owner who thinks he can play matchmaker for the pop-country superstar."
    },
    {
        "title": "Demanding Taylor Swift-Travis Kelce “Break Up” for Luka Doncic’s Teammates, Billionaire Mark Cuban Triggers 7 Word Bombshell From NFL Star",
        "description": "Mark Cuban injected a fun twist to the ongoing drama of Taylor Swift and Chiefs player Travis Kelce’s burgeoning romance. The owner of the Dallas Mavericks joked that Swift and Kelce should split up. The suggestion came days after the NFL star was seen leaving the ground with the singing sensation. Following the suggestion, the…The post Demanding Taylor Swift-Travis Kelce “Break Up” for Luka Doncic’s Teammates, Billionaire Mark Cuban Triggers 7 Word Bombshell From NFL Star appeared first on EssentiallySports."
    },
    {
        "title": "Travis Kelce Jersey Sales Spike by Nearly 400% After Taylor Swift Attends Chiefs Game",
        "description": "There is nothing the Swifties cannot do. Less than 24 hours after Taylor Swift was spotted at the Kansas City Chiefs' game versus the Chicago Bears—sitting in…"
    },
    {
        "title": "Travis Kelce Love Life: From Kayla Nicole to Taylor Swift, Meet Chiefs’ TE Girlfriends & Flings Over the Years",
        "description": "In a surprising turn of events, the hottest topic from Sunday’s game transcended the world of sports and dived into the realm of celebrity romance. The musical sensation Taylor Swift and Kansas City Chiefs star tight end Travis Kelce sparked dating rumors that have taken social media by storm. The NFL star is no stranger…The post Travis Kelce Love Life: From Kayla Nicole to Taylor Swift, Meet Chiefs’ TE Girlfriends & Flings Over the Years appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift dating rumors boost Travis Kelce jersey sales",
        "description": "Kansas City Chiefs tight end Travis Kelce points to the Chiefs decal on his helmet as fans cheer during warmups before an NFL football game against the Chicago Bears, Sunday, Sept. 24, 2023 in Kansas City, Mo.Reed Hoffmann, Associated Press Travis Kelce put in a strong showing on Sunday afternoon as his Kansas City Chiefs walloped the Chicago Bears. The tight end had seven receptions for 69 yards and a touchdown, which made him the leading receiver on his team. But to understand why Kelce’s social media follower count and jersey sales are skyrocketing right now, you have to know more than how..."
    },
    {
        "title": "Taylor Swift’s Concert Film Will Net Her Two Massive Paydays",
        "description": "The movie is on track to be a box office smash, but those future numbers only tell part of the story when it comes to how much money Swift will make from the title."
    },
    {
        "title": "I infiltrated the Taylor Swift fan Discord to talk about Travis Kelce",
        "description": "Let’s go undercover to find out what Swifties think. It started three weeks ago, back when rumors of Travis Kelce and Taylor Swift dating were a small, simmering chatter. I knew that the only way to get real information about what Swifties think of Kelce would be to go undercover to the source, to turn over every rock, to meet them on their own turf.Joining wasn’t difficult, but ingratiating myself to the Swifties was going to be one of my most difficult assignments. It felt like that moment in a mob movie where the protagonist gets caught as he has to wear a wire. There’s always that..."
    },
    {
        "title": "Years Before Taylor Swift’s “Curse” Helped Heat, Jimmy Butler Danced to Travis Kelce’s Lover’s “22” Song",
        "description": "Basketball has had a long-standing connection with the world of music—especially hip-hop. From movies and advertisements to pre-game rituals, halftime entertainment, and post-game playlists, hip-hop’s influence on basketball is wide. Notably, some players have even ventured into it by releasing their albums. However, during the 2023 NBA playoffs, it appeared as though pop music was…The post Years Before Taylor Swift’s “Curse” Helped Heat, Jimmy Butler Danced to Travis Kelce’s Lover’s “22” Song appeared first on EssentiallySports."
    },
    {
        "title": "The View’s Sara Haines believes Taylor Swift and Travis Kelce romance is a ‘publicity stunt’",
        "description": "News of Taylor Swift’s new romance with football star Travis Kelce is making headlines everywhere — except for on The View. The ladies have not discussed this hot topic on their panel, and it doesn’t look like they will. Panelist Sara Haines joined producer Brian Teta on an episode of"
    },
    {
        "title": "Travis Kelce Gushes Taylor Swift ‘Looked Amazing’ at the Chiefs Games Amid Romance Rumors",
        "description": "Travis Kelce calls Taylor Swift 'ballsy' for showing up to his Chiefs game and says everyone had 'nothing but great things to say about her.'"
    },
    {
        "title": "Days After Arrowhead Love Chapter, Will Taylor Swift Show Up at MetLife to Shout ‘LFG’ for Travis Kelce?",
        "description": "Taylor Swift was at the Arrowhead Stadium as the Kansas City Chiefs clashed with the Chicago Bears, and it was a showdown for the ages with the Chiefs dominating 41-10. Not only did the football fans witness some epic on-field action, but they also got a double dose of entertainment with Taylor Swift herself, who…The post Days After Arrowhead Love Chapter, Will Taylor Swift Show Up at MetLife to Shout ‘LFG’ for Travis Kelce? appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift and America’s problem with feminine power",
        "description": "I regret to inform you that reactionary American conservatives are once again mad at Taylor Swift. And while I won’t be linking to the recent Federalist article attacking her (they don’t need your hate clicks), I did think it funny that a conservative writer who looks like a talking thumb decided to attack her looks […]The post Taylor Swift and America’s problem with feminine power first appeared on Global Comment.The post Taylor Swift and America’s problem with feminine power appeared first on Global Comment.Related posts:First impressions: best lyrics from Taylor Swift’s..."
    },
    {
        "title": "Elle Duncan says Taylor Swift and Travis Kelce’s relationship is a ‘stunt’",
        "description": "Ever since rumblings of a relationship between Taylor Swift and Travis Kelce first made their way online, some people have been skeptical regarding the authenticity of the rumored romance. With “Traylor” mania currently at an all-time high following Swift’s presence at the Kansas City Chiefs’ win over the Chicago Bears on Sunday, ESPN’s Elle Duncan Read more...The post Elle Duncan says Taylor Swift and Travis Kelce’s relationship is a ‘stunt’ appeared first on Awful Announcing."
    },
    {
        "title": "Travis Kelce finally opens up about rumors he's dating Taylor Swift: 'She looked amazing'",
        "description": "After Taylor Swift's day at Arrowhead Stadium, Travis Kelce finally opens about the rumors about the two dating ... sort of."
    },
    {
        "title": "Travis Kelce talked Taylor Swift on his podcast",
        "description": "Travis Kelce was already famous, but now he is learning what it means to be Taylor Swift-adjacent-famous."
    },
    {
        "title": "Heinz creates new condiment in honour of Taylor Swift and Travis Kelce",
        "description": "A viral caption from a fan account inspired the new limited edition sauceThe post Heinz creates new condiment in honour of Taylor Swift and Travis Kelce appeared first on NME."
    },
    {
        "title": "Moments Before Swooning Over Taylor Swift With A Four-Word Message, Travis Kelce Replies if Chiefs HC Andy Reid Played The Match Maker",
        "description": "Where coaches are known for their strategic minds and game plans, Kansas City Chiefs head coach Andy Reid recently revealed a surprising skill – matchmaking. In a jaw-dropping confession that left fans and media buzzing, Reid claimed to have played Cupid in the lives of pop sensation Taylor Swift and his star tight end Travis Kelce.…The post Moments Before Swooning Over Taylor Swift With A Four-Word Message, Travis Kelce Replies if Chiefs HC Andy Reid Played The Match Maker appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift Smiles in Silence After Dave Portnoy Shares Heartfelt Remarks About NFL Boyfriend Travis Kelce",
        "description": "The internet has been blowing up lately with Travis Kelce. In the past few weeks, as rumors of the Kansas City Chiefs tight end dating Taylor Swift grow stronger, everyone on the internet is commenting on this potential relationship. These rumors gained momentum after Swift was snapped at one of Kelce’s games, along with his…The post Taylor Swift Smiles in Silence After Dave Portnoy Shares Heartfelt Remarks About NFL Boyfriend Travis Kelce appeared first on EssentiallySports."
    },
    {
        "title": "Patrick Mahomes admits helping Travis Kelce show off for Taylor Swift",
        "description": "Kansas City Chiefs quarterback Patrick Mahomes confessed he helped Travis Kelce show off for Taylor Swift."
    },
    {
        "title": "Will Taylor Swift’s ‘The Eras Tour’ Movie Be On Streaming?",
        "description": "Getty Image Swift's concert movie is set to hit theaters soon, but what about streaming?"
    },
    {
        "title": "Traylor is that you? Gaming couple nicknames for Travis Kelce and Taylor Swift",
        "description": "Originally Published: 25 SEP 23 10:09 ET Updated: 25 SEP 23 11:29 ET By Lisa Respers France, CNN (CNN) — Game on. Travis Kelce said the ball was in Taylor Swift’s court after he made a play for her, and the singer appears to have caught his pass. To be clear, we still don’t knowThe post Traylor is that you? Gaming couple nicknames for Travis Kelce and Taylor Swift appeared first on KVIA."
    },
    {
        "title": "Native American group hopes Taylor Swift’s influence could end tomahawk chop during Chiefs games",
        "description": "A Native American organization is hoping Taylor Swift’s emergence at a Kansas City Chiefs game over the weekend and link to tight end Travis Kelce can help turn the tide and end the tomahawk chop.Swift was in a suite next to Donna Kelce, Travis’ mother, during the Chiefs’ 41-10 win over the Chicago Bears on Sunday. In one video, fans around her are doing the tomahawk chop, but Swift doesn’t join in.Not in Our Honor founder Rhonda LeValdo told TMZ that she hopes Swift can help end the chop, which is a gesture used by some fans to celebrate but which some people say is a racist stereotype..."
    },
    {
        "title": "The NFL may have wanted Taylor Swift for the Super Bowl halftime show. What they got instead was even better",
        "description": "The singer was rumored to be dating the Kansas City Chiefs’ Travis Kelce before she showed up to watch him in person, sitting next to his mom."
    },
    {
        "title": "Hours After Taylor Swift Announcement, Gisele Bündchen Shares Tear-Stained Reflections in Six Words As Tom Brady Divorce Nears Anniversary",
        "description": "Gisele Bündchen, ex-wife of NFL legend Tom Brady, shares a heartfelt post on her Instagram account. The 43-year-old Brazillian supermodel has been in the news ever since her recent interview was released. In the interview, Bündchen talked about the deeper intricacies of her life and was able to show the world a more personal side…The post Hours After Taylor Swift Announcement, Gisele Bündchen Shares Tear-Stained Reflections in Six Words As Tom Brady Divorce Nears Anniversary appeared first on EssentiallySports."
    },
    {
        "title": "Hours After Taylor Swift Cheered for Rumored Boyfriend Travis Kelce, Lakers’ Austin Reaves Addresses Being Linked to “Shake it Off” Star",
        "description": "In the last 48 hours, the US sporting world has been going gaga over the Taylor Swift-Travis Kelce dating rumors. While the couple has yet to give an official word, fans and online sports pages have already made romantic content with the duo. Importantly, it brought significant change to viewership and merchandise sales. Meanwhile, on…The post Hours After Taylor Swift Cheered for Rumored Boyfriend Travis Kelce, Lakers’ Austin Reaves Addresses Being Linked to “Shake it Off” Star appeared first on EssentiallySports."
    },
    {
        "title": "Travis Kelce Spoke In Depth About Taylor Swift Attending His Game And Relationship Rumors On His ‘New Heights’ Podcast",
        "description": "FOX 'Shout out to Taylor for pullin' up, that was pretty ballsy.'"
    },
    {
        "title": "Travis Kelce breaks down his Taylor Swift-centric Sunday. Was it enchanting to meet her?",
        "description": "Travis Kelce brought this on himself and he knows that. That was his insistence, at least, on the podcast he hosts with his brother. On this week’s episode of New Heights, Jason Kelce and the most-talked-about bachelor in America dove deep into how the Kansas City Chiefs tight end went from a Hall of Fame-bound player…Read more..."
    },
    {
        "title": "Travis Kelce notes Taylor Swift’s ‘bold’ appearance at Chiefs game but is mum about any relationship",
        "description": "Kansas City tight end Travis Kelce calls Taylor Swift’s appearance at the Chiefs victory over the Chicago Bears “pretty bold” but wants to remain private about his relationship with the superstar singer. Speaking on his podcast “New Heights with Jason and Travis Kelce” that premiered on Wednesday morning, Kelce discussed Swift’s well-publicized appearance in a suite at Arrowhead Stadium with his family during Sunday’s 41-10 victory. The 12-time Grammy Award winner sat next to Kelce’s mom, Donna, and yelled during the game. While he acknowledged being more in the media spotlight..."
    },
    {
        "title": "Patriots Captain Has Great Take On Travis Kelce-Taylor Swift Relationship",
        "description": "FOXBORO, Mass. — Like his head coach, one New England Patriots team captain is a fan of the romance that’s taken over the NFL news cycle. Patriots tight end Hunter Henry on Wednesday saluted Kansas City Chiefs counterpart Travis Kelce for his new relationship with pop star Taylor Swift. “There’s a lot of good pub […]"
    },
    {
        "title": "Taylor Swift & Travis Kelce Have Reportedly Stepped Out Together Only Twice So Far",
        "description": "The Kansas City Chiefs star and 'Love Story' hitmaker are inspiring headlines, but a source says it's still in its early stages."
    },
    {
        "title": "“Keep an Eye”: Fans Jubilant as NFL Insider Jordan Schultz Reveals Taylor Swift Expected to Attend Sunday Night Football at Metlife",
        "description": "Taylor Swift might light up the Kansas City Chiefs game on October 2. That’s right, an NFL insider has hinted at the fact. If the sources are true, the fans are in for a treat on Sunday night. The Chiefs’ quarterback Travis Kelce has been dating Taylor Swift for a while now, and the singer…The post “Keep an Eye”: Fans Jubilant as NFL Insider Jordan Schultz Reveals Taylor Swift Expected to Attend Sunday Night Football at Metlife appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift Was The ‘First Person’ To See Jack Antonoff As A Producer, He Explained",
        "description": "Getty Image He's worked with Lorde, Lana Del Rey, Carly Rae Jepsen, and more."
    },
    {
        "title": "Barbie, Beyoncé and Taylor Swift Are Winning the Attention Sweepstakes for Brands This Summer",
        "description": "Launchmetrics data shows big wins for fashion houses dressing the singers' tours — and creating pink-heavy collaborations with the famous doll."
    },
    {
        "title": "Exclusive: Joey King on wedding planning and keeping a secret for Taylor Swift",
        "description": "Joey King spoke exclusively with HELLO! about planning her wedding, herself as a bride and keeping a secret for Taylor Swift"
    },
    {
        "title": "Taylor Swift’s ‘August’ And Adorable Spinning Pets Are Taking Over TikTok With A Hilarious New Trend",
        "description": "Getty Image Some Swifties are having super cute and funny times on TikTok right now."
    },
    {
        "title": "Taylor Swift security guard fired for being hilarious",
        "description": "Let’s get this out of the way first: Taylor Swift herself did not fire a security guard for singing along to a song at her concert. In fact, that’s the kind of thing she probably gives out big cash bonuses for. But a security guard did get fired for his conduct at the Eras Tour—not so much for the singing along but…Read more..."
    },
    {
        "title": "Soccer Mommy Announced Her ‘Karaoke Night’ EP And Unveiled Her Cover Of A Taylor Swift Deep Cut",
        "description": "The project also features renditions of songs by artists like R.E.M. and Sheryl Crow."
    },
    {
        "title": "Taylor Swift Has Another Song From ‘Reputation (Taylor’s Version)’ Coming Very Soon",
        "description": "In the midst of her ongoing tour, Taylor Swift is making headlines across the music scene."
    },
    {
        "title": "NFL seizing on Taylor Swift is shallow and unsurprising considering its history of courting female fans",
        "description": "This isn't really a \"pop cultural moment\" the NFL should be exploiting for its own gain."
    },
    {
        "title": "Travis Kelce says NFL is ‘overdoing’ his connection with Taylor Swift",
        "description": "Pop star has watched Kansas City player’s last two gamesNFL has featured Swift heavily during its broadcastsTravis Kelce has admitted the NFL may be putting too much focus on the relationship between himself and Taylor Swift.Swift has been in attendance to watch two of Kelce’s games for the Kansas City Chiefs this season, although they have not confirmed they are in a romantic relationship. Everyone appears to benefit from the attention: sales of Kelce’s jersey sales have surged, the NFL’s viewing figures among younger people have risen and ads for Swift’s new film have been broadcast..."
    },
    {
        "title": "Dear NFL, ‘You Need to Calm Down’ with the Taylor Swift thing",
        "description": "The NFL has been completely milking the Travis Kelce and Taylor Swift relationship, and NFL fans across the world, including myself, are already sick of it.The post Dear NFL, ‘You Need to Calm Down’ with the Taylor Swift thing appeared first on Daily Forty-Niner."
    },
    {
        "title": "Travis Kelce criticises NFL over Taylor Swift coverage",
        "description": "NFL star Travis Kelce has criticised the sports league for some of their coverage of Taylor Swift at recent games. Swift has been spotted at the last few matches of the Kansas City Chiefs – the team that Kelce plays for in the NFL – amid rumours that the two are dating. Indeed, the league […]"
    },
    {
        "title": "Taylor Swift's Eras Tour movie hits a presale record for Cinemark",
        "description": "Taylor Swift's concert film hasn't even been released yet and it's already toppling box-office records."
    },
    {
        "title": "Is Taylor Swift’s ‘Anti-Hero’ About To Become Her Biggest Hot 100 Hit?",
        "description": "\"Anti-Hero,\" Swift's 2022 hit, has now spent an impressive 49 weeks on the Hot 100 chart, making it one of her longest-charting tracks."
    },
    {
        "title": "Taylor Swift Is Good for the NFL, Says Virginia Tech Sports Media Expert",
        "description": "Taylor Swift's Swifties and professional football fanatics typically do not rub elbows. But in the past two weeks, they've been finding some common ground.   When the pop superstar attended a Sunday night prime time NFL match-up between the Kansas City Chiefs and the New York Jets, her appearance set in motion a frenzy of attention and situated the league in front of a new fan base."
    },
    {
        "title": "Vinyl Sales See a Significant Increase in 2023 Driven by Releases from Taylor Swift, Lana Del Rey, Blur",
        "description": "The old adage, “Everything old is new again,” rings true for music lovers. The industry saw a significant bump in vinyl sales over the first three quarters of 2023. Experts predict that the trend will continue into the final quarter of the year. Upcoming releases from acts like the Rolling Stones and Taylor Swift signal […]The post Vinyl Sales See a Significant Increase in 2023 Driven by Releases from Taylor Swift, Lana Del Rey, Blur appeared first on American Songwriter."
    },
    {
        "title": "“Can’t Get Enough of Taylor Swift,” Acknowledges Stephen A. Smith, as He Draws Parallels Between NFL and Pop Queen’s Staggering Popularity",
        "description": "In American culture, two apparently diverse worlds have united the enthusiasm of millions. The NFL and pop icon Taylor Swift. Sports and music, presumably distinct domains, have surprisingly clustered due to the indisputable parallels. However, in their enormous popularity, twist themselves within the nation’s cultural fabric. This exclusive phenomenon, highlighted by perspective analyst Stephen A.…The post “Can’t Get Enough of Taylor Swift,” Acknowledges Stephen A. Smith, as He Draws Parallels Between NFL and Pop Queen’s Staggering Popularity appeared first..."
    },
    {
        "title": "5 Things We Can Expect from Taylor Swift’s ‘Eras Tour’ Movie",
        "description": "Taylor Swift‘s Eras Tour has been a mainstay in pop culture over the last year. Those who didn’t catch Swift along her lauded trek now have a chance to witness all the action when the movie version of the tour premieres on October 13. While we eagerly wait for the movie, check out five things […]The post 5 Things We Can Expect from Taylor Swift’s ‘Eras Tour’ Movie appeared first on American Songwriter."
    },
    {
        "title": "Amid MetLife Photographs, Kansas City Chiefs’ Travis Kelce Ends Up Scoring Zero Touchdowns in Front of Rumored Beau Taylor Swift",
        "description": "There was a star-studded crowd at MetLife Stadium on Sunday night, but Taylor Swift would’ve wanted only one to shine the brightest. Kansas City Chiefs TE mesmerized everyone, including 12-time Grammy-winning pop star, with his touchdown against the Bears last week. Unfortunately, he couldn’t replicate that in New York. The New York Jets have been…The post Amid MetLife Photographs, Kansas City Chiefs’ Travis Kelce Ends Up Scoring Zero Touchdowns in Front of Rumored Beau Taylor Swift appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift And Blake Lively’s Friendship Was Accidentally Predicted By ‘Gossip Girl’",
        "description": "Getty Image Lively attended the Chiefs vs. Jets game with Swift."
    },
    {
        "title": "Inside Taylor Swift's squad: How the singer built up her iron-clad group of A-list pals as she's supported by the likes of Blake Lively and Hugh Jackman at boyfriend Travis Kelce's big game",
        "description": "Her section at MetLife Stadium was bursting at the seams with Hollywood stars, including the likes of Blake Lively , Ryan Reynolds and Sophie Turner ."
    },
    {
        "title": "The flirty comment Taylor Swift made to celeb pal Blake Lively in the stands at MetLife Stadium while watching Travis Kelce play for Chiefs",
        "description": "Taylor's latest night out at MetLife Stadium in New Jersey set the internet ablaze, as she partied with the likes of Sophie Turner, Sabrina Carpenter and Ryan Reynolds in a suite while watching the Chiefs."
    },
    {
        "title": "After Travis Kelce’s Zero TD Performance in Front of Taylor Swift, Patrick Mahomes Concedes Being ‘Greedy’ Against Jets",
        "description": "The Kansas City Chiefs are on their conquest to Super Bowl glory for the third time. Don’t believe us? Take a look at their stellar record this season. The Chiefs are currently sitting at 3-1 after their epic showdown with the New York Jets at the star-studded MetLife Stadium. The reigning champions proved that not…The post After Travis Kelce’s Zero TD Performance in Front of Taylor Swift, Patrick Mahomes Concedes Being ‘Greedy’ Against Jets appeared first on EssentiallySports."
    },
    {
        "title": "Jets' Sauce Gardner Jokes Ref Might Not Have Thrown Flag If He Was a Taylor Swift Fan",
        "description": "New York Jets cornerback Sauce Gardner thinks Sunday may have gone a little differently if he was a \"Swiftie.\" Gardner was called for a controversial holding…"
    },
    {
        "title": "‘Shake It Off’ with the Taylor Swift, Travis Kelce content | Editorial",
        "description": "Taylor Swift and Travis Kelce have captured the attention of the country with their budding relationship. But, has the media gone too far with its coverage of the duo?"
    },
    {
        "title": "“The Perfect Villain”: As Dave Portnoy Sparks Debate, Fans Rally Behind Injured Aaron Rodgers Over Taylor Swift’s Starry NFL Presence",
        "description": "The Kansas City Chiefs defeated the New York Jets 23-20 in a thrilling match on Sunday night. Hours after the match started, Dave Portnoy, CEO of Barstool Sports also known for sparking controversies, Tweeted Aaron Rodgers‘ blank face. Dave Portnoy took it to Twitter to compare two of the opponent’s stands, mentioning the excitement during…The post “The Perfect Villain”: As Dave Portnoy Sparks Debate, Fans Rally Behind Injured Aaron Rodgers Over Taylor Swift’s Starry NFL Presence appeared first on EssentiallySports."
    },
    {
        "title": "All of the Taylor Swift references during the Jets vs. Chiefs game",
        "description": "Taylor Swift, second from left, and Brittany Mahomes, second from right, watch play between the New York Jets and the Kansas City Chiefs during the second quarter of an NFL football game, Sunday, Oct. 1, 2023, in East Rutherford, N.J. Frank Franklin II, Associated Press Taylor Swift interrupted the NFL again Sunday night by watching the Kansas City Chiefs play against the New York Jets at Metlife Stadium. She brought along a gaggle of other major stars to watch the game and was spotted with Donna Kelce, Chiefs tight end Travis Kelce’s mom, again. The game averaged 27 million viewers, making..."
    },
    {
        "title": "The NFL Media Needs a Better List of Taylor Swift References",
        "description": "No more cheer captains, blank spaces, and wildest dreams."
    },
    {
        "title": "Metro’s push for Taylor Swift concerts is seen as test for 2028 LA Olympics",
        "description": "LA Metro's response to six Taylor Swift concerts was a trial run for the 2028 Los Angeles Olympic Games."
    },
    {
        "title": "Kayla Nicole: What to Know About Travis Kelce’s Ex Who Unfollowed Brittany Mahomes After Taylor Swift Outing",
        "description": "Before Taylor Swift sparked romance rumors with Travis Kelce, he was dating Kayla Nicole. Find out more about his now ex and what she's been up to since splitting from the NFL player."
    },
    {
        "title": "Stevie Nicks References Taylor Swift As She Discusses The Future Of Fleetwood Mac",
        "description": "\"When I think about Taylor Swift’s song ‘You’re on Your Own, Kid’ and the line ‘you always have been,’ it was like, that was Christine and I.”"
    },
    {
        "title": "Chiefs' Travis Kelce admits NFL may be 'overdoing' Taylor Swift coverage; league denies claim",
        "description": "It turns out that there may be too much Swelce happening. At least, according to the Chiefs tight end."
    },
    {
        "title": "‘We Taylor-gated’: Taylor Swift Fans Descend on a Jets Game",
        "description": "Football fans mingled with Swifties, on public transit, in the parking lot and at the game. Everyone was dressed for the occasion."
    },
    {
        "title": "NFL removes weird Taylor Swift reference from Instagram bio after backlash",
        "description": "The NFL on Monday faced some backlash over a bizarre — if not cringeworthy — addition to the one of the league’s official social media pages. Following the Kansas City Chiefs’ win over the New York Jets on Sunday night, a line was added to the league’s official Instagram bio that read “chiefs are 2-0...The post NFL removes weird Taylor Swift reference from Instagram bio after backlash appeared first on Larry Brown Sports."
    },
    {
        "title": "Travis Kelce’s Ex Kayla Nicole Unfollows Friend Brittany Mahomes After She Hangs Out With Taylor Swift",
        "description": "Kayla Nicole and Brittany Mahomes were good friends -- but Travis Kelce's ex unfollowed Brittany after she was seen hanging out with Taylor Swift!"
    },
    {
        "title": "The Taylor Swift-Travis Kelce Romance Saga Is a Gift That Keeps On Giving, Jets vs. Chiefs Beats Viewership Record Set by Super Bowl LVII",
        "description": "The Taylor Swift and Travis Kelce saga isn’t over yet. The 12-time Grammy winner was eager to watch more football action at MetLife Stadium, and so were the people living in Taylor’s world. The New York Jets and the Kansas City Chiefs faced off in a game on Sunday at 8:20 p.m. ET. The Chiefs…The post The Taylor Swift-Travis Kelce Romance Saga Is a Gift That Keeps On Giving, Jets vs. Chiefs Beats Viewership Record Set by Super Bowl LVII appeared first on EssentiallySports."
    },
    {
        "title": "Carson Daly uses Taylor Swift references to explain Kansas City Chiefs vs. New York Jets game",
        "description": "“This guy, Travis Kelce, well, he plays for the Kansas City Chiefs, who are basically the ‘next great American dynasty’ in the NFL\"The post Carson Daly uses Taylor Swift references to explain Kansas City Chiefs vs. New York Jets game appeared first on NME."
    },
    {
        "title": "Taylor Swift And Travis Kelce Skeletons Appear In Indiana For Halloween",
        "description": "Taylor Swift and Travis Kelce's fling has now gotten the Halloween decor treatment ... popping up in an Indiana town as two massive skeletons. The spooky era decorations recently appeared outside Michal Owens' house in Zionsville, IN -- the…"
    },
    {
        "title": "Days After Taylor Swift’s Dynamic Cheerleading for Travis Kelce, Another Kansas City Chiefs’ Player Catches Pop Fever",
        "description": "The Taylor Swift fever is now affecting the Kansas City Chiefs players. After taking the NFL world by storm, the pop sensation has entered the dressing room of the Chiefs. The NFL’s official Instagram and Twitter handles witnessed change. Its Instagram handle mentioned, “The chiefs are 2-0 as swifties.” The Twitter banner featured Swift’s picture. …The post Days After Taylor Swift’s Dynamic Cheerleading for Travis Kelce, Another Kansas City Chiefs’ Player Catches Pop Fever appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift and Travis Kelce: Sparks Fly or marketing genius? | Opinion",
        "description": "Taylor Swift, right, watches from a suite alongside Travis Kelce’s mother, Donna Kelce, inside Arrowhead Stadium during game between the Chicago Bears and Kansas City Chiefs Sunday, Sept. 24, 2023, in Kansas City, Mo.Ed Zurga, Associated Press Maybe Travis Kelce’s romance with Tay Tay will last about as long as Aaron Rodgers’ gig with the Jets, but for now everyone is running with it. Madison Avenue, the NFL and Swift’s staff must be staying up late each night coming up with ways to exploit this thing for all it’s worth while it lasts, and apparently they convinced the football gods..."
    },
    {
        "title": "David Beckham Addresses ‘Noise’ Surrounding Taylor Swift & Travis Kelce Romance: ‘She Deserves to Be Happy’",
        "description": "As speculation about Taylor's romance with the NFL star intensifies, David Beckham stepped forward to defend the singer's right to a happy life."
    },
    {
        "title": "Taylor Swift Wears Blue Dress For Jack Antonoff & Margaret Qualley’s Wedding: Watch",
        "description": "Jack Antonoff and Margaret Qualley had one very special guest at their Aug. 19 wedding -- the one and only Taylor Swift!"
    },
    {
        "title": "Meaning Behind Taylor Swift’s Revenge Anthem “Vigilante Sh**”",
        "description": "Taylor Swift has a number of empowering songs. Much of 1989 and Midnights is tailor-made to help you strut down the street with your head held high. Some of her bolstering tunes are on the sweeter or poignant side – “You’re On Your Own, Kid” – while others embrace the darker sides of life. “Vigilante […]The post Meaning Behind Taylor Swift’s Revenge Anthem “Vigilante Sh**” appeared first on American Songwriter."
    },
    {
        "title": "Taylor Swift Fans Swarm Jack Antonoff’s Rehearsal Dinner",
        "description": "When revealed Taylor Swift would be attending the rehearsal dinner of her producer Jack Antonoff and actress Margaret Qualley, Swifties ambushed the event. The rehearsal dinner occurred at Black Whale Bar & Fish House in Long Beach Island, New Jersey on August 18. Video footage shared on TikTok depicts mobs of fans standing outside the […]The post Taylor Swift Fans Swarm Jack Antonoff’s Rehearsal Dinner appeared first on American Songwriter."
    },
    {
        "title": "Bill Belichick Praised Taylor Swift’s Toughness After Seeing The Eras Tour, But Won’t Call Himself A Swiftie",
        "description": "Getty Image Belichick's takeaway from the Eras Tour was extremely on brand, as is his favorite Taylor Swift song."
    },
    {
        "title": "NFL responds to backlash over Taylor Swift-Travis Kelce coverage",
        "description": "The NFL has completely leaned into the rumored Taylor Swift-Travis Kelce romance. The league’s infatuation for its newest (maybe) it-couple has been quite polarizing for a handful of fans. The NFL recently made a daring move, at least by social media standards, when it referenced Swift in the bio portion of the league’s official Instagram...The post NFL responds to backlash over Taylor Swift-Travis Kelce coverage appeared first on Larry Brown Sports."
    },
    {
        "title": "Travis Kelce’s mom feels she’s in an ‘alternate universe’ hanging out with Taylor Swift",
        "description": "Travis Kelce’s mom feels she is in an “alternate universe” hanging out with Taylor Swift. The NFL star is believed to have been romancing the ‘Bad Blood’ hitmaker for the last few months and the 33-year-old pop star has been spending time with his mother Donna Kelce watching his Kansas City Chiefs games, and the […]"
    },
    {
        "title": "Travis Kelce’s Rumored Love Interest Taylor Swift Can Possibly Defeat Donald Trump at the Presidential Elections, Feels Top Official",
        "description": "A former White House communications director during the Donald Trump presidency has recently injected humor and speculation into the mix by suggesting that the iconic pop sensation Taylor Swift could be the one to take on the former President in the 2024 presidential race. Could Taylor Swift really be the one to defeat Donald Trump…The post Travis Kelce’s Rumored Love Interest Taylor Swift Can Possibly Defeat Donald Trump at the Presidential Elections, Feels Top Official appeared first on EssentiallySports."
    },
    {
        "title": "Entangled in Travis Kelce Romance Saga, Taylor Swift’s NFL Exploits Compared to Ryan Reynolds’ $2,500,000 Investment by 28YO Star",
        "description": "The spotlight never dims on Taylor Swift. As the singer continues to dazzle audiences with her Eras Tour, the American pop sensation finds herself caught in a ‘love story’ with NFL star Travis Kelce. Interestingly, her constant incursion into the world of the NFL is now being compared to Ryan Reynolds’ $2.5 million investment in…The post Entangled in Travis Kelce Romance Saga, Taylor Swift’s NFL Exploits Compared to Ryan Reynolds’ $2,500,000 Investment by 28YO Star appeared first on EssentiallySports."
    },
    {
        "title": "Paramore’s Hayley Williams Recalls Friendship with Taylor Swift and Taylor Swift’s Mom on ‘The Tonight Show’",
        "description": "Taylor Swift is absolutely everywhere right now. From her soon-to-be released Eras Tour film to outings at Kansas City Chiefs football games, her star power has perhaps never been brighter. Paramore’s Hayley Williams stopped by The Tonight Show Starring Jimmy Fallon to talk about exactly that — as well as her decades-long friendship with Swift, […]The post Paramore’s Hayley Williams Recalls Friendship with Taylor Swift and Taylor Swift’s Mom on ‘The Tonight Show’ appeared first on American Songwriter."
    },
    {
        "title": "Taylor Swift’s Eras Tour Film Has Already Reached $100 Million in Presale Tickets",
        "description": "Taylor Swift definitely has the power. In addition to breaking all kinds of records and recently reaching the 1 billion streams club on Spotify, as reported by Deadline, her Eras Tour film has already sold more that $100 million in advance tickets globally. And the movie isn’t set for release until October 13. According to […]The post Taylor Swift’s Eras Tour Film Has Already Reached $100 Million in Presale Tickets appeared first on American Songwriter."
    },
    {
        "title": "American Women Coco Gauff and Taylor Swift’s Unprecedented Dominance Triggers ‘Culture Shift’ Prophecy by Chelsea Handler as 52YO WTA Coach Issues a Shout-Out",
        "description": "Women’s tennis has reached new milestones this year. Coco Gauff, who won her first slam, attracted more viewers than her male counterparts during the US Open final. As the achievement was lauded by American comedian and actress, Chelsea Handler, a former coach of Serena Williams joined in to show her excitement. While tennis is growing in…The post American Women Coco Gauff and Taylor Swift’s Unprecedented Dominance Triggers ‘Culture Shift’ Prophecy by Chelsea Handler as 52YO WTA Coach Issues a Shout-Out appeared first on EssentiallySports."
    },
    {
        "title": "“Don’t Like to Talk About It”- Jason Kelce’s Mom Donna Reveals How Travis Kelce’s Romance With Taylor Swift Has ‘Amped’ Up Her Life",
        "description": "Travis Kelce and Taylor Swift‘s unofficial relationship is a hot topic in the entire world right now. Kelce seems genuinely happy with how the rumored romance has played out so well. Now with Swift attending Kelce’s games two weeks in a row and meeting the ‘family’, things are moving to the next level. The recent…The post “Don’t Like to Talk About It”- Jason Kelce’s Mom Donna Reveals How Travis Kelce’s Romance With Taylor Swift Has ‘Amped’ Up Her Life appeared first on EssentiallySports."
    },
    {
        "title": "Travis Kelce’s Mom Tries To Play It Cool About Bonding With Taylor Swift!",
        "description": "Travis Kelce’s momma is keeping her lips sealed when it comes to her son’s budding romance with Taylor Swift! Perezcious readers know that the 33-year-old singer hung out with Donna Kelce at the 34-year-old football player’s game against the Chicago Bears last month. The two reunited a week later at the Kansas City Chiefs game [...]Read More...The post Travis Kelce’s Mom Tries To Play It Cool About Bonding With Taylor Swift! appeared first on Perez Hilton."
    },
    {
        "title": "Taylor Swift’s Delicious Cookie Recipe Is Returning To The Spotlight Ahead Of ‘1989 (Taylor’s Version)’",
        "description": "Getty Image/Merle Cooper Be sure to make Taylor Swift's chai sugar cookies for your '1989 (Taylor's Version)' listening party."
    },
    {
        "title": "From Taylor Swift’s $100m concert film presales to Deezer’s new artist-centric deal… it’s MBW’s Weekly Round-Up",
        "description": "The five biggest stories to hit our headlines over the past seven days...Source"
    },
    {
        "title": "Never mind the Taylor Swift hysteria, Vikings more concerned with Travis Kelce’s other connection",
        "description": "The rapport Kelce has with Chiefs quarterback Patrick Mahomes is on another level."
    },
    {
        "title": "Donna Kelce says NFL is ‘laughing all the way to the bank’ with Taylor Swift, Travis Kelce dating rumors",
        "description": "There’s no denying the impact that Taylor Swift’s rumored relationship with Kansas City Chiefs’ tight end Travis Kelce has had on the NFL, and according to Donna Kelce, the league is fully embracing it. Donna Kelce stepped into the spotlight last season when both of her sons, Travis and Philadelphia Eagles center Jason Kelce, faced off in the Super Bowl against one another. Since then, the NFL mom has found herself living a life she calls \"surreal.\"\"It’s just very surreal. In fact, I was just thinking on Sunday going to both games and everything that has happened within the past 12..."
    },
    {
        "title": "Chiefs' Travis Kelce addresses if Taylor Swift is a distraction",
        "description": "All-Pro tight end Travis Kelce insists his relationship with entertainment superstar Taylor Swift isn't a distraction as the 3-1 Kansas City Chiefs prepare to play at the 1-3 Minnesota Vikings this Sunday. "
    },
    {
        "title": "New club brings together Taylor Swift enthusiasts",
        "description": "Every time one of Taylor Swift’s albums is out, her fans are ecstatic. To purchase Taylor Swift tickets, everyone gets up as early as possible in the morning. Taylor Swift is adored by many people, and her influence on countless lives is unmatched.   The ability to to talk and express one’s love for Taylor Swift..."
    },
    {
        "title": "Taylor Swift Gives $100,000 Bonuses to Eras Tour Truckers",
        "description": "Taylor Swift is sharing the wealth from her wildly successful Eras Tour ... in the form of six-figure bonuses for the truckers hauling her equipment all around the country! Our Taylor sources tell us she gifted each trucker working her tour…"
    },
    {
        "title": "Eleni Kounalakis hypocritically calls for Taylor Swift to cancel concerts after attending Taylor Swift concert",
        "description": "California needs better leadership and it’s not going to get it from politicians like Kounalakis who throw logic out the window to appease hysterical unions."
    },
    {
        "title": "Eleni Kounalakis hypocritically calls for Taylor Swift to cancel concerts after attending Taylor Swift concert",
        "description": "California needs better leadership and it’s not going to get it from politicians like Kounalakis who throw logic out the window to appease hysterical unions."
    },
    {
        "title": "Eleni Kounalakis hypocritically calls for Taylor Swift to cancel concerts after attending Taylor Swift concert",
        "description": "California needs better leadership and it’s not going to get it from politicians like Kounalakis who throw logic out the window to appease hysterical unions."
    },
    {
        "title": "Taylor Swift tour coming to Canada with 6 nights in Toronto",
        "description": "The announcement comes after Swift left Canada out of nearly 40 new tour dates released in June, disappointing her Canadian fans."
    },
    {
        "title": "What surprise songs are left for Taylor Swift Eras Tour LA tour dates?",
        "description": "Here's a complete list of every surprise song Taylor Swift has played during the Eras tour, and what's still to come."
    },
    {
        "title": "What surprise songs are left for Taylor Swift Eras Tour LA tour dates?",
        "description": "Here's a complete list of every surprise song Taylor Swift has played during the Eras tour, and what's still to come."
    },
    {
        "title": "Taylor Swift Eras Tour truck drivers receive ‘life-changing’ $100,000 bonuses",
        "description": "Taylor Swift, the pop sensation known for her chart-topping hits and captivating performances, is making headlines once again. This time, it’s not just for her music, but for her incredible generosity towards the hardworking crew members of her Eras Tour. Swift has decided to show her appreciation to the dedicated truck drivers who have been […]The post Taylor Swift Eras Tour truck drivers receive ‘life-changing’ $100,000 bonuses appeared first on NewsReports."
    },
    {
        "title": "Swifties react to Kobe Bryant’s daughter receiving a gift from Taylor Swift during the Eras Tour",
        "description": "Taylor Swift surprised Kobe and Vanessa Bryant’s daughter Bianka with what fans have deemed the “22 hat” during night one of the Eras Tour in LA."
    },
    {
        "title": "Swifties react to Taylor Swift’s surprise songs for Night One of the Eras Tour in Los Angeles",
        "description": "Taylor Swift surprised fans with acoustic performances of \"I Can See You\" and \"Maroon\" during night one of the Eras Tour in Los Angeles."
    },
    {
        "title": "Swifties react to Taylor Swift’s surprise songs for Night One of the Eras Tour in Los Angeles",
        "description": "Taylor Swift surprised fans with acoustic performances of \"I Can See You\" and \"Maroon\" during night one of the Eras Tour in Los Angeles."
    },
    {
        "title": "Swifties react to Taylor Swift’s surprise songs for Night One of the Eras Tour in Los Angeles",
        "description": "Taylor Swift surprised fans with acoustic performances of \"I Can See You\" and \"Maroon\" during night one of the Eras Tour in Los Angeles."
    },
    {
        "title": "Swifties react to Kobe Bryant’s daughter receiving a gift from Taylor Swift during the Eras Tour",
        "description": "Taylor Swift surprised Kobe and Vanessa Bryant’s daughter Bianka with what fans have deemed the “22 hat” during night one of the Eras Tour in LA."
    },
    {
        "title": "Swifties react to Kobe Bryant’s daughter receiving a gift from Taylor Swift during the Eras Tour",
        "description": "Taylor Swift surprised Kobe and Vanessa Bryant’s daughter Bianka with what fans have deemed the “22 hat” during night one of the Eras Tour in LA."
    },
    {
        "title": "Taylor Swift in LA",
        "description": "Coverage of Taylor Swift performance at SoFi Stadium in Inglewood in August 2023."
    },
    {
        "title": "Taylor Swift gifts $130K bonuses to truckers, $75M in total to Eras Tour staff",
        "description": "Nearly 50 truckers who worked on Taylor Swift's Eras tour each received a 'life-changing' six-figure bonus."
    },
    {
        "title": "Taylor Swift adds Canada tour dates after Trudeau plea",
        "description": "OTTAWA (Aug 4): US superstar Taylor Swift announced Thursday several Toronto dates for her much-hyped world tour after a plea from Prime Minister Justin Trudeau not to skip Canada. Concert sponsor Rogers Communications said in a statement that Swift will perform six shows as part of her “Eras Tour” in Canada’s largest city, and that tickets would soon go on [...]"
    },
    {
        "title": "Gracie Abrams to Meet Fans for Pandora ‘Good Riddance’ Engraved Necklace Giveaway During Taylor Swift ‘Eras’ Tour in Los Angeles",
        "description": "The singer joined Taylor Swift on Wednesday for her Los Angeles show date of her ongoing \"Eras\" tour."
    },
    {
        "title": "They spent thousands to see Taylor Swift’s The Eras Tour. The experience is priceless",
        "description": "These Orange County mother-daughter duos are hardcore Swifties and they're out to make memories by going to several of the dates at SoFi Stadium in Inglewood this month."
    },
    {
        "title": "They spent thousands to see Taylor Swift’s The Eras Tour. The experience is priceless",
        "description": "These Orange County mother-daughter duos are hardcore Swifties and they're out to make memories by going to several of the dates at SoFi Stadium in Inglewood this month."
    },
    {
        "title": "They spent thousands to see Taylor Swift’s The Eras Tour. The experience is priceless",
        "description": "These Orange County mother-daughter duos are hardcore Swifties and they're out to make memories by going to several of the dates at SoFi Stadium in Inglewood this month."
    },
    {
        "title": "Will ‘Barbie’ or Taylor Swift magic help close women’s pay gap?",
        "description": "Women's median weekly wages statewide ran 88% of the men's in 2021. Nationally, a female got paid 83 cents for every $1 a man got."
    },
    {
        "title": "Will ‘Barbie’ or Taylor Swift magic help close women’s pay gap?",
        "description": "Women's median weekly wages statewide ran 88% of the men's in 2021. Nationally, a female got paid 83 cents for every $1 a man got."
    },
    {
        "title": "Will ‘Barbie’ or Taylor Swift magic help close women’s pay gap?",
        "description": "Women's median weekly wages statewide ran 88% of the men's in 2021. Nationally, a female got paid 83 cents for every $1 a man got."
    },
    {
        "title": "Will ‘Barbie’ or Taylor Swift magic help close women’s pay gap?",
        "description": "Women's median weekly wages statewide ran 88% of the men's in 2021. Nationally, a female got paid 83 cents for every $1 a man got."
    },
    {
        "title": "Sofia Vergara Sparkles In Black For Taylor Swift’s Concert After Split From Joe Manganiello: Photos",
        "description": "The 'America's Got Talent' star rocked a striped ensemble when she attended the popular show with Anastasia Soare, the founder of the Anastasia Beverly Hills salon."
    },
    {
        "title": "Radio: There’s even more Taylor Swift on the radio this week",
        "description": "Richard Wagoner writes about radio."
    },
    {
        "title": "SoFi Stadium’s Taylor Swift merch sale brings out the masses – a day before the shows even begin",
        "description": "From overnight camping to hours of waiting to quick sell-outs, Swifties rushed to social media to document the Eras Tour early merchandise day in Inglewood."
    },
    {
        "title": "11 Taylor Swift Eras Tour Themed Experiences for Southern California Swifties",
        "description": "Southern California businesses have curated unique experiences for Taylor Swift fans such as special menus, album-themed photo ops and bracelet stations."
    },
    {
        "title": "11 Taylor Swift Eras Tour Themed Experiences for Southern California Swifties",
        "description": "Southern California businesses have curated unique experiences for Taylor Swift fans such as special menus, album-themed photo ops and bracelet stations."
    },
    {
        "title": "Taylor Swift Fan Buys Concert Tickets For Wrong Date, Turned Away at Venue",
        "description": "A couple of big Taylor Swift fans are out lots of loot and a great show ... showing up at the venue a day after the concert went down!!! Bear Silber tells TMZ ... he snagged a pair of tickets for him and his wife months ago for what he thought was…"
    },
    {
        "title": "Levi’s Stadium: Santa Clara fines Taylor Swift’s pyrotechnics company for curfew-breaking fireworks",
        "description": "Taylor Swift's Santa Clara shows ended after the 11 p.m. curfew last weekend."
    },
    {
        "title": "Taylor Swift Faces Political Pressure Amidst Eras Tour – OpEd",
        "description": "“Whether you’re a fan of Taylor Swift or not, it’s hard to deny the cultural and financial juggernaut the pop superstar has become,” the Harvard Gazette contends. Her album “Midnights,” released in late 2022, was the year’s top-seller at 1.8 million copies, and “Speak Now” debuted at number one, enabling Swift to surpass Barbra Streisand for “the most number-one albums by a woman artist.”As part of her “The Eras Tour,” Swift has scheduled five shows in August at SoFi Stadium in Inglewood. California Lt. Gov. Eleni Kounalakis tried to shut down the star..."
    },
    {
        "title": "Radio: There’s even more Taylor Swift on the radio this week",
        "description": "Richard Wagoner writes about radio."
    },
    {
        "title": "Radio: There’s even more Taylor Swift on the radio this week",
        "description": "Richard Wagoner writes about radio."
    },
    {
        "title": "Taylor Swift should ignore the hollow hysterics of Unite Here Local 11 and continue shows as normal",
        "description": "The selfish union and politically impotent Eleni Kounalakis should be ignored, writes Michael Saltsman."
    },
    {
        "title": "Taylor Swift should ignore the hollow hysterics of Unite Here Local 11 and continue shows as normal",
        "description": "The selfish union and politically impotent Eleni Kounalakis should be ignored, writes Michael Saltsman."
    },
    {
        "title": "Got Taylor Swift tickets? A helicopter company will fly you to the show for $2,499",
        "description": "Limousine companies say their service is the fanciest way to go to a concert. Helicopter company says, Hold my beer."
    },
    {
        "title": "Got Taylor Swift tickets? A helicopter company will fly you to the show for $2,499",
        "description": "Limousine companies say their service is the fanciest way to go to a concert. Helicopter company says, Hold my beer."
    },
    {
        "title": "Got Taylor Swift tickets? A helicopter company will fly you to the show for $2,499",
        "description": "Limousine companies say their service is the fanciest way to go to a concert. Helicopter company says, Hold my beer."
    },
    {
        "title": "Taylor Swift fans navigate LA traffic, train connections, crowds to first concert at SoFi",
        "description": "The adept, well-planned Swifties seem to take LA traffic and long lines in stride at the first Taylor Swift concert in years taking place at SoFi in Inglewood."
    },
    {
        "title": "Taylor Swift fans navigate LA traffic, train connections, crowds to first concert at SoFi",
        "description": "The adept, well-planned Swifties seem to take LA traffic and long lines in stride at the first Taylor Swift concert in years taking place at SoFi in Inglewood."
    },
    {
        "title": "Taylor Swift recognized Kobe Bryant’s daughter in touching moment at Eras Tour",
        "description": "Taylor Swift gave Kobe Bryant’s daughter a rare souvenir from her Eras Tour. Taylor Swift has made it to Los Angeles for record-breaking Eras Tour, where he she played the first of six dates at SoFi Stadium on Thursday night. Famous faces have been popping up at Swift’s tour since it began earlier this year, and on Thursday, Vanessa Bryant had a front row seat with her daughters. Swift and Kobe Bryant were friends before his passing in a tragic helicopter accident in 2020, and the superstar singer made it a point to recognize his family.As Swift was performing her 2012 hit “22,” she..."
    },
    {
        "title": "Photos: 'Swifties' descend on Sofi for Taylor Swift's The Eras tour",
        "description": "Swifties unite."
    },
    {
        "title": "Will ‘Barbie’ or Taylor Swift magic help close women’s pay gap?",
        "description": "Women's median weekly wages statewide ran 88% of the men's in 2021. Nationally, a female got paid 83 cents for every $1 a man got."
    },
    {
        "title": "Will ‘Barbie’ or Taylor Swift magic help close women’s pay gap?",
        "description": "Women's median weekly wages statewide ran 88% of the men's in 2021. Nationally, a female got paid 83 cents for every $1 a man got."
    },
    {
        "title": "Taylor Swift didn't want a massive paycheque for use of music in Heartstopper",
        "description": "Taylor Swift was more than happy for her music to soundtrack a \"beautiful\" scene in 'Heartstopper' without earning mega money."
    },
    {
        "title": "Politicians urge Taylor Swift to postpone LA concerts in solidarity with striking hotel workers",
        "description": "LOS ANGELES (AP) — California’s lieutenant governor and other elected officials on Tuesday urged Taylor Swift to postpone her Los Angeles concerts as a way to stand in solidarity with striking hotel workers. Lt. Gov. Eleni Kounalakis and dozens of state and local politicians signed an open letter telling Swift that her tour makes the […]"
    },
    {
        "title": "Has Taylor Swift Forever Changed How Musicians Will Promote Singles?",
        "description": "For those who haven’t noticed, Taylor Swift is currently promoting two singles simultaneously, and they didn't seem to hurt one another."
    },
    {
        "title": "Taylor Swift should ignore the hollow hysterics of Unite Here Local 11 and continue shows as normal",
        "description": "The selfish union and politically impotent Eleni Kounalakis should be ignored, writes Michael Saltsman."
    },
    {
        "title": "Emily Ratajkowski Tells Troye Sivan That She Was a “Misogynist” When She “Didn’t F— With Taylor Swift”",
        "description": "During a recent episode of her podcast, High Low With EmRata, model and actress Emily Ratajkowski referred to herself as a “misogynist” because of past thoughts on Taylor Swift. While speaking with “Rush” singer Troye Sivan, Ratajkowski revealed that she never enjoyed Swift’s music in the past, but started to appreciate the highly-celebrated artist when she […]The post Emily Ratajkowski Tells Troye Sivan That She Was a “Misogynist” When She “Didn’t F— With Taylor Swift” appeared first on American Songwriter."
    },
    {
        "title": "Taylor Swift fans brave sun, long lines for official merch a day before she launches 6 SoFi shows",
        "description": "The Taylor Swift's six days of concerts at SoFi Stadium in Inglewood hasn't even started. But the fan experience is well underway."
    },
    {
        "title": "Gracie Abrams: 5 Things To Know About Singer Opening For Taylor Swift On Tour",
        "description": "Gracie Abrams has been announced as the opening act for all of Taylor Swift's new US and Canada shows in the fall. Here's what you need to know about Gracie."
    },
    {
        "title": "Swifties are beyond excited as Taylor Swift kicks off her six nights at SoFi Stadium",
        "description": "We talked to fans who arrived hours before showtime about what this day and Taylor Swift mean to them."
    },
    {
        "title": "Taylor Swift fans navigate LA traffic, train connections, crowds to first concert at SoFi",
        "description": "The adept, well-planned Swifties seem to take LA traffic and long lines in stride at the first Taylor Swift concert in years taking place at SoFi in Inglewood."
    },
    {
        "title": "Taylor Swift fans navigate LA traffic, train connections, crowds to first concert at SoFi",
        "description": "The adept, well-planned Swifties seem to take LA traffic and long lines in stride at the first Taylor Swift concert in years taking place at SoFi in Inglewood."
    },
    {
        "title": "Swifties react to Kobe Bryant’s daughter receiving a gift from Taylor Swift during the Eras Tour",
        "description": "Taylor Swift surprised Kobe and Vanessa Bryant’s daughter Bianka with what fans have deemed the “22 hat” during night one of the Eras Tour in LA."
    },
    {
        "title": "Swifties react to Kobe Bryant’s daughter receiving a gift from Taylor Swift during the Eras Tour",
        "description": "Taylor Swift surprised Kobe and Vanessa Bryant’s daughter Bianka with what fans have deemed the “22 hat” during night one of the Eras Tour in LA."
    },
    {
        "title": "Taylor Swift Kicks Off L.A. Concerts, Performs Rare Song Live For First Time",
        "description": "The City of Angels is officially the City of Swifties -- Taylor Swift has kicked off her 6 sold-out shows in Los Angeles, and fans had a lot to go wild over on night number 1. Taylor took the stage Thursday night at SoFi Stadium for her \"Eras\" tour…"
    },
    {
        "title": "Taylor Swift gives onstage hug to Kobe Bryant's daughter Bianka at 'Eras' show in California",
        "description": "Taylor Swift shared a moment onstage with Bianka Bryant, the 6-year-old daughter of Kobe Bryant, during the \"Eras\" concert in Inglewood, Calif."
    },
    {
        "title": "Taylor Swift’s Song ‘August’ Is Making A Very Timely Comeback",
        "description": "The Folklore song was a hit when it first arrived three years ago, and now it's about to become one again."
    },
    {
        "title": "Where To Park Near SoFi Stadium For Taylor Swift’s ‘The Eras Tour’",
        "description": "Getty Image Did you manage to get 'The Eras Tour' tickets? Congratulations, but there's still more planning to do."
    },
    {
        "title": "Taylor Swift urged to postpone LA shows as hotel workers strike",
        "description": "By Parija Kavilanz, CNN New York (CNN) — “Swifties” heading to Los Angeles to see Taylor Swift concerts this week may find a large number of staff at their hotels on strike when they get there. The union representing 15,000 hotel workers who have been staging a series of rolling strikes since the start ofThe post Taylor Swift urged to postpone LA shows as hotel workers strike appeared first on KTVZ."
    },
    {
        "title": "Dreaming of Taylor Swift to Perform in Wrexham, Ryan Reynolds Splurges Money on Upliftment of Welsh Indie Folk Band",
        "description": "Ever since Ryan Reynolds and Rob McElhenney took over Wrexham, they completely changed the landscape of the city. They worked and strategised day and night for the club which is why the Red Dragons are a household name in the USA today. In a similar act of solidarity for the city, the duo is now…The post Dreaming of Taylor Swift to Perform in Wrexham, Ryan Reynolds Splurges Money on Upliftment of Welsh Indie Folk Band appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift, SZA lead 2023′s MTV Video Music Award nominations",
        "description": "Taylor Swift is nominated for Artist of the Year, along with Beyoncé, Doja Cat, KAROL G, Nicki Minaj and Shakira."
    },
    {
        "title": "Starbucks Is Looking To Cash In On Taylor Swift’s Popularity",
        "description": "The Eras Tour has come to a close in America (for now), and Starbucks wants to have some fun with this occasion."
    },
    {
        "title": "Driver frustration with VTA may be tied to Taylor Swift shows: Roadshow",
        "description": "And readers respond to a question last week about the runways at San Jose International Airport."
    },
    {
        "title": "International Cat Day: See Taylor Swift & More Stars Cuddling Their Kitties",
        "description": "Happy International Cat Day! Take a look at our favorite A-listers cuddling up to their feline friends including Taylor Swift & Khloe Kardashian."
    },
    {
        "title": "Taylor Swift’s Canadian ticket sale is almost here. Are you ready for it?",
        "description": "Unless more Canadian dates are added, Taylor Swift will only perform at the Rogers Centre in downtown Toronto from Nov. 14 to 16, 2024, and then Nov. 21 to 23."
    },
    {
        "title": "Taylor Swift Confirms October 27 Release Date For “1989 (Taylor’s Version),” Says Vault Tracks Are “So Insane”",
        "description": "As her “The Eras Tour” concluded a six-night stint at SoFi Stadium, Taylor Swift shared some eagerly anticipated news with her fans. The artist confirmed a release date for the re-recording of her smash hit 2014 album “1989.” According to Swift, “1989 (Taylor’s Version)” will arrive on October 27. Swift calls the re-recording her favorite […]The post Taylor Swift Confirms October 27 Release Date For “1989 (Taylor’s Version),” Says Vault Tracks Are “So Insane” appeared first on Headline Planet."
    },
    {
        "title": "Taylor Swift announces October release of ’1989 (Taylor’s Version)’ at Eras Tour show in Los Angeles",
        "description": "LOS ANGELES (AP) — Taylor Swift closed the 2023 U.S. leg of her landmark Eras Tour at the Los Angeles SoFi Stadium in a big way by announcing the fourth edition of her re-recording project: “1989 (Taylor’s Version.)” After playing a few tracks from her “1989” era live, the pop star approached the center of […]"
    },
    {
        "title": "Taylor Swift Announces Long-Awaited &#8216;1989 (Taylor&#8217;s Version)&#8217;",
        "description": "Taylor Swift Announces Long-Awaited ‘1989 (Taylor’s Version)’"
    },
    {
        "title": "Taylor Swift, SZA lead 2023′s MTV Video Music Award nominations",
        "description": "Taylor Swift is nominated for Artist of the Year, along with Beyoncé, Doja Cat, KAROL G, Nicki Minaj and Shakira."
    },
    {
        "title": "'You have to have a strategy': Fans ready to snatch up Taylor Swift Toronto tickets",
        "description": "One Taylor Swift fan says that if she is not able to secure a ticket to any of the superstar's tour dates in Toronto, she'll stand outside the venue all six nights anyway."
    },
    {
        "title": "What is the Taylor Swift bracelet trend - and why are people sporting the jewellery at the Women's World Cup?",
        "description": "Taylor Swift's bracelet trend has been sported by high-profile celebrities such as Gigi Hadid and Jennifer Garner, and has now debuted at the Women's World Cup in Australia"
    },
    {
        "title": "‘1989 (Taylor’s Version)’: Everything We Know About Taylor Swift’s Upcoming Re-Record",
        "description": "Taylor Swift fans are on high alert for the announcement of when she'll drop '1989 (Taylor's Version).' Here's everything we know so far!"
    },
    {
        "title": "Taylor Swift announces ‘1989 (Taylor’s Version)’ at ‘Eras Tour’ show",
        "description": "\"This is my most FAVORITE re-record I’ve ever done\"The post Taylor Swift announces ‘1989 (Taylor’s Version)’ at ‘Eras Tour’ show appeared first on NME."
    },
    {
        "title": "Taylor Swift fans shocked after spotting Karlie Kloss at Eras Tour following rumored fall out",
        "description": "Taylor Swift fans took to X, formerly known as Twitter, to discuss"
    },
    {
        "title": "Flavor Flav would be ‘honored’ to record with Taylor Swift",
        "description": "Flavor Flav has become a ‘Swiftie’ and recently attended several of the superstar’s concerts. “She ripped it,” he says of L.A. show."
    },
    {
        "title": "Charlize Theron Dances With Her 2 Daughters At Taylor Swift Concert: ‘Best Birthday Ever’",
        "description": "Charlize Theron and her daughters busted out their dance moves to 'Shake It Off' at the Eras Tour at SoFi Stadium."
    },
    {
        "title": "Meghan Markle attends Taylor Swift's Eras Tour in Los Angeles with friends as Prince Harry visits Japan",
        "description": "Meghan Markle attended Taylor Swift's Eras Tour concert in Los Angeles on Tuesday August 8 with friend Lucy Fraser. Taylor Swift's Eras Tour concludes the first US leg in LA."
    },
    {
        "title": "Meghan Markle 'jumped out of her chair to sing along to You Belong with Me at Taylor Swift at LA show' - but didn't snap a photo with the star like other celebs after Spotify 'snub'",
        "description": "The Duchess of Sussex, 42, attended the pop sensation's show at SoFi stadium in Los Angeles on Tuesday night, according to PEOPLE magazine ."
    },
    {
        "title": "Taylor Swift announces '1989 (Taylor's Version)' release date",
        "description": "Pop music icon Taylor Swift has announced that her next album, \"1989 (Taylor's Version,)\" will be released on Oct. 27."
    },
    {
        "title": "Taylor Swift Reveals the Release of ‘1989 (Taylor’s Version)’ After Final Eras Show",
        "description": "Saving some of her best news for last, Taylor Swift surprised fans with the announcement that she’s releasing 1989 (Taylor’s Version) on October 27. Swift revealed the news following her final show of the North American leg of her Eras Tour on Wednesday (Aug. 9) at the SoFi Stadium in Inglewood, California. “Surprise!! 1989 (Taylor’s Version) is […]The post Taylor Swift Reveals the Release of ‘1989 (Taylor’s Version)’ After Final Eras Show appeared first on American Songwriter."
    },
    {
        "title": "Beyoncé’s Record-Breaking Renaissance Tour Set to Top Taylor Swift’s Eras",
        "description": "You know you’re a badass when the records you break are your own. But then again, Beyoncé is a transcendent artist whom the normal rules of pop culture don’t apply to.Read more..."
    },
    {
        "title": "Kevin Costner Declares Himself a Swiftie, Raves About Taylor Swift Concert",
        "description": "Kevin Costner is a big-time Taylor Swift fan, and he doesn't care who knows it ... giving massive props to the singer after taking in one of her six record-setting shows in L.A. TMZ broke the story -- Kevin was in a private suite Monday at SoFi…"
    },
    {
        "title": "Taylor Swift leads MTV nominations with eight",
        "description": "Awards will take place September 12, and fans have until the end of August to vote"
    },
    {
        "title": "Meghan Markle 'enjoys girls' night out at Taylor Swift concert in LA' while dutiful husband Harry shops for his wife on business trip to Tokyo with friend and polo player Nacho Figueras",
        "description": "While Meghan was enjoying the atmosphere in California, hard working Harry was able to find the time to do some shopping for the family in Tokyo with his friend Nacho Figueras."
    },
    {
        "title": "Taylor Swift announces ‘1989 (Taylor’s Version)’ and release date",
        "description": "Taylor Swift has announced her next re-recorded album: 1989 (Taylor's Version). The latest album comes off the heels of her redone releases Fearless, Red, and Speak Now."
    },
    {
        "title": "Taylor Swift Extends 'The Eras Tour' to Indianapolis in 2024: A Musical Journey You Don't Want to Miss!",
        "description": "In a surprising twist, on Aug. 3 Taylor Swift took to her social media platforms to announce that The Eras Tour in 2023 was, in fact, not the end of an era. Instead, Taylor announced an extension of the tour into the fall of 2024! This extended tour will take place in North America—Miami, New […]The post Taylor Swift Extends 'The Eras Tour' to Indianapolis in 2024: A Musical Journey You Don't Want to Miss! appeared first on The DePauw."
    },
    {
        "title": "Matty Healy 'set to reunite with Taylor Swift' on new album",
        "description": "The 1975 frontman Matty Healy is reportedly set to collaborate with Taylor Swift on her new album."
    },
    {
        "title": "Question of the Day: Was Taylor Swift or Shakira Best-Dressed at the 2023 VMAs?",
        "description": "The real showstopper at the 2023 MTV VMA Awards was the fashion! Tell us who you think won the night for best-dressed at the 2023 MTV VMAs. Was it Taylor Swift in a leggy black Versace dress or Shakira in her golden goddess Versace chain-mail gown? Today's poll is brought to you by LoveBook. Vote below!"
    },
    {
        "title": "Taylor Swift and her ‘Anti-Hero’ tops MTV VMAs in a show dominated by hip-hop, K-pop and Latin jams",
        "description": "Taylor Swift took home the top prize at the 2023 MTV Video Music Awards her “Anti-Hero” music video on a night full of surprises. Swift won four trophies on Tuesday's telecast, including song of the year, best pop video and best direction. As much as Swift dominated, the VMAs centered on music’s global power. K-pop boy band Tomorrow X Together and Brazilian superstar Anitta premiered their new collaboration, the glossy retro-pop of “Back for More.” Shakira delivered a packed medley of her hits and accepted the Video Vanguard Award, while Diddy performed with his..."
    },
    {
        "title": "MTV VMAs: Taylor Swift wins four awards, including 'Video of the Year'",
        "description": "The 2023 MTV Video Music Awards celebrated Tuesday night in New Jersey with host Nicki Minaj, a big *NSYNC reunion and four wins for Taylor Swift, including Video of the Year."
    },
    {
        "title": "‘Drunk Taylor’ Trends As Taylor Swift’s Chaotic Moments At The 2023 VMAs Served As Great Entertainment For Fans",
        "description": "Getty Image She danced her way throughout the night."
    },
    {
        "title": "USA Today seeks ‘unbiased’ Taylor Swift beat reporter",
        "description": "Are you a Swiftie? Well do I NOT have a job for you. That’s right … Gannett Media announced a new job opportunity as a Taylor Swift reporter for The Tennessean and USA Today. But here’s the catch… you have to be an unbiased journalist. Who is the perfect candidate? Here’s what the job announcement Read more...The post USA Today seeks ‘unbiased’ Taylor Swift beat reporter appeared first on Awful Announcing."
    },
    {
        "title": "Travis Kelce Injury Report – Kansas City Chiefs TE Breaks Silence but Remains Unmoved on Taylor Swift Rumors",
        "description": "Just before the season opener match of the Kansas City Chiefs against the Detroit Lions, Chiefs’ tight end, Travis Kelce suffered an injury. During one of his practice matches on 5 September, the Super Bowl champion hyperextended his knee. Due to this injury, he couldn’t play in the first match but was there to support…The post Travis Kelce Injury Report – Kansas City Chiefs TE Breaks Silence but Remains Unmoved on Taylor Swift Rumors appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift’s ‘Cruel Summer’ Is One Space Shy Of Hitting No. 1…In Canada",
        "description": "“Cruel Summer” has now been held back from hitting No. 1 on the Canadian Hot 100 for two weeks by Doja Cat’s “Paint the Town Red.”"
    },
    {
        "title": "3 Months after Taylor Swift Rumors, $53,827,872 Rich Austin Reaves’ Actual Girlfriend Comes to Light",
        "description": "Hill Billy Kobe aka Austin Reaves has become one of the emerging faces of the Los Angeles Lakers. Since his clutch buckets against the Grizzlies, screaming “I’m him” cross-court, Reeves has become a fan favorite. However, his private life has always been a mystery, as Reaves isn’t too keen on making it public. A few…The post 3 Months after Taylor Swift Rumors, $53,827,872 Rich Austin Reaves’ Actual Girlfriend Comes to Light appeared first on EssentiallySports."
    },
    {
        "title": "His Wife Blew Up At Hime For Not Supporting Her Obsession With Taylor Swift",
        "description": "Like many other women around the world, this man’s wife adores Taylor Swift. However, he feels like his wife supports her favorite musician a little bit too enthusiastically. Over the past year, Taylor Swift’s music is all that his wife listens to. While his wife works out or does household chores, her music is constantly […]"
    },
    {
        "title": "Taylor Swift and her ‘Anti-Hero’ top MTV VMAs in a show dominated by hip-hop, K-pop and Latin jams",
        "description": "Taylor Swift took home the top prize at the 2023 MTV Video Music Awards her “Anti-Hero” music video on a night full of surprises. Swift won four trophies on Tuesday's telecast, including song of the year, best pop video and best direction. As much as Swift dominated, the VMAs centered on music’s global power. K-pop boy band Tomorrow X Together and Brazilian superstar Anitta premiered their new collaboration, the glossy retro-pop of “Back for More.” Shakira delivered a packed medley of her hits and accepted the Video Vanguard Award, while Diddy performed with his..."
    },
    {
        "title": "MTV VMAs: From Taylor Swift and 'NSYNC to Olivia Rodrigo's set collapse, here are the takeaways",
        "description": "MTV Video Music Awards takeaways — from Taylor Swift fangirling 'NSYNC to Olivia Rodrigo's set collapse and P. Diddy's family affair."
    },
    {
        "title": "Edmonton Elks Labour Day Classic rematch to include Taylor Swift concert ticket giveaway",
        "description": "The Edmonton Elks are expecting over 30,000 people at Commonwealth Stadium Saturday when they give away two tickets to a Taylor Swift concert in Paris, France."
    },
    {
        "title": "ESPN’s New Host Pat McAfee Uncovers The Hidden Truth Behind Travis Kelce & Taylor Swift’s $770M ‘Dating’",
        "description": "ESPN’s latest scoop from their new host, Pat McAfee, lights up the rumor mill, raising eyebrows about Travis Kelce and Taylor Swift’s $770 ESPN’s latest scoop from their new host, Pat McAfee, lights up the rumor mill, raising eyebrows about Travis Kelce and Taylor Swift’s $770 million “hangouts.” Let’s dive right in and uncover this…The post ESPN’s New Host Pat McAfee Uncovers The Hidden Truth Behind Travis Kelce & Taylor Swift’s $770M ‘Dating’ appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift’s ‘1989’ Singles Were Huge; Get Ready For Them To Be Huge All Over Again",
        "description": "Many of the songs on 1989 were big hits when the album first dropped. Now, with a re-recorded version on the way, what's to stop them from blowing up once more?"
    },
    {
        "title": "Taylor Swift Arrives for 2023 VMAs in Plunging Black Gown With High Slit",
        "description": "Fresh off her massively successful 'Eras World Tour,' Taylor Swift made a dazzling appearance at the 2023 MTV Video Music Awards on Tuesday!"
    },
    {
        "title": "“Karma” Collaborators Taylor Swift, Ice Spice Connect At Tuesday’s MTV Video Music Awards",
        "description": "Earlier this year, Taylor Swift welcomed Ice Spice for a remix of her hit single “Karma.” They also performed the song at the MetLife Stadium stop of Swift’s “The Eras Tour.” Tuesday night, the artists connected at the MTV Video Music Awards. The two sat next to each other during the show, and photos from […]The post “Karma” Collaborators Taylor Swift, Ice Spice Connect At Tuesday’s MTV Video Music Awards appeared first on Headline Planet."
    },
    {
        "title": "Travis Kelce, Taylor Swift have reportedly been spending time together",
        "description": "Travis Kelce is a big Taylor Swift fan, and the Kansas City Chiefs star said over the summer that he shamelessly tried to get Swift’s attention before one of her shows. It sounds like his persistence eventually paid off. During an episode of his “New Heights” podcast back in July, Kelce told his brother and...The post Travis Kelce, Taylor Swift have reportedly been spending time together appeared first on Larry Brown Sports."
    },
    {
        "title": "Taylor Swift spokesperson responds to rumours The 1975’s Matty Healy features on new version of ‘1989’",
        "description": "Conflicting reports have emerged this weekThe post Taylor Swift spokesperson responds to rumours The 1975’s Matty Healy features on new version of ‘1989’ appeared first on NME."
    },
    {
        "title": "Dreaming of Taylor Swift to Perform in Wrexham, Ryan Reynolds Splurges Money on Upliftment of Welsh Indie Folk Band",
        "description": "Ever since Ryan Reynolds and Rob McElhenney took over Wrexham, they completely changed the landscape of the city. They worked and strategised day and night for the club which is why the Red Dragons are a household name in the USA today. In a similar act of solidarity for the city, the duo is now…The post Dreaming of Taylor Swift to Perform in Wrexham, Ryan Reynolds Splurges Money on Upliftment of Welsh Indie Folk Band appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift leads MTV nominations with eight",
        "description": "Awards will take place September 12, and fans have until the end of August to vote"
    },
    {
        "title": "Taylor Swift, SZA lead 2023′s MTV Video Music Award nominations",
        "description": "Taylor Swift is nominated for Artist of the Year, along with Beyoncé, Doja Cat, KAROL G, Nicki Minaj and Shakira."
    },
    {
        "title": "Meghan Markle 'enjoys girls' night out at Taylor Swift concert in LA' while dutiful husband Harry shops for his wife on business trip to Tokyo with friend and polo player Nacho Figueras",
        "description": "While Meghan was enjoying the atmosphere in California, hard working Harry was able to find the time to do some shopping for the family in Tokyo with his friend Nacho Figueras."
    },
    {
        "title": "Meghan Markle 'jumped out of her chair to sing along to You Belong with Me at Taylor Swift at LA show' - but didn't snap a photo with the star like other celebs after Spotify 'snub'",
        "description": "The Duchess of Sussex, 42, attended the pop sensation's show at SoFi stadium in Los Angeles on Tuesday night, according to PEOPLE magazine ."
    },
    {
        "title": "Taylor Swift announces October release of ’1989 (Taylor’s Version)’ at Eras Tour show in Los Angeles",
        "description": "LOS ANGELES (AP) — Taylor Swift closed the 2023 U.S. leg of her landmark Eras Tour at the Los Angeles SoFi Stadium in a big way by announcing the fourth edition of her re-recording project: “1989 (Taylor’s Version.)” After playing a few tracks from her “1989” era live, the pop star approached the center of […]"
    },
    {
        "title": "International Cat Day: See Taylor Swift & More Stars Cuddling Their Kitties",
        "description": "Happy International Cat Day! Take a look at our favorite A-listers cuddling up to their feline friends including Taylor Swift & Khloe Kardashian."
    },
    {
        "title": "Taylor Swift’s Canadian ticket sale is almost here. Are you ready for it?",
        "description": "Unless more Canadian dates are added, Taylor Swift will only perform at the Rogers Centre in downtown Toronto from Nov. 14 to 16, 2024, and then Nov. 21 to 23."
    },
    {
        "title": "'You have to have a strategy': Fans ready to snatch up Taylor Swift Toronto tickets",
        "description": "One Taylor Swift fan says that if she is not able to secure a ticket to any of the superstar's tour dates in Toronto, she'll stand outside the venue all six nights anyway."
    },
    {
        "title": "Taylor Swift announces ‘1989 (Taylor’s Version)’ and release date",
        "description": "Taylor Swift has announced her next re-recorded album: 1989 (Taylor's Version). The latest album comes off the heels of her redone releases Fearless, Red, and Speak Now."
    },
    {
        "title": "Taylor Swift, SZA lead 2023′s MTV Video Music Award nominations",
        "description": "Taylor Swift is nominated for Artist of the Year, along with Beyoncé, Doja Cat, KAROL G, Nicki Minaj and Shakira."
    },
    {
        "title": "Meghan Markle attends Taylor Swift's Eras Tour in Los Angeles with friends as Prince Harry visits Japan",
        "description": "Meghan Markle attended Taylor Swift's Eras Tour concert in Los Angeles on Tuesday August 8 with friend Lucy Fraser. Taylor Swift's Eras Tour concludes the first US leg in LA."
    },
    {
        "title": "Taylor Swift announces ‘1989 (Taylor’s Version)’ at ‘Eras Tour’ show",
        "description": "\"This is my most FAVORITE re-record I’ve ever done\"The post Taylor Swift announces ‘1989 (Taylor’s Version)’ at ‘Eras Tour’ show appeared first on NME."
    },
    {
        "title": "Taylor Swift Reveals the Release of ‘1989 (Taylor’s Version)’ After Final Eras Show",
        "description": "Saving some of her best news for last, Taylor Swift surprised fans with the announcement that she’s releasing 1989 (Taylor’s Version) on October 27. Swift revealed the news following her final show of the North American leg of her Eras Tour on Wednesday (Aug. 9) at the SoFi Stadium in Inglewood, California. “Surprise!! 1989 (Taylor’s Version) is […]The post Taylor Swift Reveals the Release of ‘1989 (Taylor’s Version)’ After Final Eras Show appeared first on American Songwriter."
    },
    {
        "title": "Starbucks Is Looking To Cash In On Taylor Swift’s Popularity",
        "description": "The Eras Tour has come to a close in America (for now), and Starbucks wants to have some fun with this occasion."
    },
    {
        "title": "Driver frustration with VTA may be tied to Taylor Swift shows: Roadshow",
        "description": "And readers respond to a question last week about the runways at San Jose International Airport."
    },
    {
        "title": "Beyoncé’s Record-Breaking Renaissance Tour Set to Top Taylor Swift’s Eras",
        "description": "You know you’re a badass when the records you break are your own. But then again, Beyoncé is a transcendent artist whom the normal rules of pop culture don’t apply to.Read more..."
    },
    {
        "title": "Taylor Swift Announces Long-Awaited &#8216;1989 (Taylor&#8217;s Version)&#8217;",
        "description": "Taylor Swift Announces Long-Awaited ‘1989 (Taylor’s Version)’"
    },
    {
        "title": "Taylor Swift And Travis Kelce Lookalikes Will Be Everywhere, As Halloween Costumes Sell Out",
        "description": "They've already run out of over 800 Swift/Kelce costumes and are preparing for a new shipment"
    },
    {
        "title": "You don't have to be a Swiftie to love Taylor Swift. The Eras tour movie premiere proves it",
        "description": "As influential as her music is, Taylor Swift's legacy is most clearly reflected in the devotion on display at the world premiere of her new concert film."
    },
    {
        "title": "Beyonce Makes Surprise Appearance at Taylor Swift’s ‘Eras Tour’ Movie Premiere: ‘An Actual Fairytale’",
        "description": "Beyoncé showed up to support Taylor Swift at her 'Eras Tour' movie premiere in Los Angeles, and Taylor gushed over how Bey's been a 'guiding light' to her over the years."
    },
    {
        "title": "Beyoncé Joins Taylor Swift At The Latter&#8217;s Concert Movie Premiere",
        "description": "Beyoncé Joins Taylor Swift At The Latter’s Concert Movie Premiere"
    },
    {
        "title": "Taylor Swift returns to Arrowhead Stadium to see Travis Kelce and the Chiefs face the Broncos",
        "description": "KANSAS CITY, Mo. (AP) — Pop superstar Taylor Swift was back at Arrowhead Stadium on Thursday night to watch Travis Kelce and the Kansas City Chiefs take on the Denver Broncos, one day after walking the red carpet at the premiere of her concert movie. Swift and Kelce have been in a budding relationship the […]"
    },
    {
        "title": "Taylor Swift Projected to Make $4.1 Billion from Eras Tour",
        "description": "For Taylor Swift, it pays to take her show on the road -- and into theaters, too -- she's cold be raking in a whopping $4.1 BILLION from her super popular \"Eras\" tour. The eye-popping figure would means Taylor owns the most lucrative concert tour…"
    },
    {
        "title": "‘S.N.L’ Returns With Pete Davidson and a Taylor Swift Cameo",
        "description": "The show’s first new broadcast in six months opened with a somber reflection by Davidson, the host, and included a brief appearance by Swift, who was a running theme of the episode."
    },
    {
        "title": "'Taylor Swift: The Eras Tour' concert film sets box office records",
        "description": "A juggernaut opening weekend — historic for a concert film — will be a much-needed shot in the arm for an industry hobbled by strikes."
    },
    {
        "title": "Taylor Swift’s ‘The Eras Tour’ dances to No. 1 at the box office, eyeing 'Joker' film record",
        "description": "Movie theaters turned into concert venues this weekend as Swifties brought their dance moves and friendship bracelets to multiplexes across the country. The unparalleled enthusiasm helped propel “Taylor Swift: The Eras Tour” to a massive, first place debut between $95 million and $97 million in North America, AMC Theatres said Sunday. It’s easily the biggest opening for a concert film of all time, and, not accounting for inflation, has made more than the $73 million “Justin Bieber: Never Say Nev"
    },
    {
        "title": "Taylor Swift, Travis Kelce's Couples Halloween Costumes Sell Out Online",
        "description": "Folks who wanna be Taylor Swift and Travis Kelce can play make-believe on Halloween -- and it's a lock that lots of people will do just that, much to the joy of one costume shop raking in the dough. A rep for 3 Wishes, an online Halloween retailer,…"
    },
    {
        "title": "One Question for Taylor Swift’s Eras Concert Film: How Big Will It Be?",
        "description": "The pop star’s concert film, arriving in theaters on Friday, is expected to break box office records. “The fever and scale is unprecedented,” one analyst said."
    },
    {
        "title": "Taylor Swift Wants Boyfriend Travis Kelce to Shave",
        "description": "This article was last updated on October 11, 2023 Canada: Oye! Times readers Get FREE $30 to spend on Amazon, Walmart…USA: Oye! Times readers Get ......Read More"
    },
    {
        "title": "Taylor Swift effect? Cowboys-49ers 'Sunday Night Football' game delivers top NFL audience among women",
        "description": "Taylor Swift might be popular, but she's not as popular as the Dallas Cowboys."
    },
    {
        "title": "Taylor Swift: The Eras Tour concert film comes to Vancouver Friday",
        "description": "Like the live shows, the movie is breaking records for advance ticket sales and should become the biggest concert film of all time"
    },
    {
        "title": "Taylor Swift Likely to Create a Positive Impact on Travis Kelce — Here Is What Research Says",
        "description": "The Chiefs are flying high on confidence, registering four straight wins with only a single loss this season. The numbers speak for themselves. Well, the last two wins have come against well-established sides, the Jets (23-20) and the Vikings (27-20). The Patrick Mahomes and Travis Kelce duo have been doing wonders for the Chiefs for…The post Taylor Swift Likely to Create a Positive Impact on Travis Kelce — Here Is What Research Says appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift: The Eras Tour review: A love letter to fans (Taylor’s version)",
        "description": "If ever there was a review-proof movie, it’s the Taylor Swift: The Eras Tour concert film. You probably already know whether you want to see it or not, and no critical analysis of its value as a film or a filmgoing experience is likely to change that. Advanced ticket sales have already surpassed $100 million and it’s…Read more..."
    },
    {
        "title": "As Patrick Mahomes’ Wife Celebrates Travis Kelce & Co.’s 19–8 Win With Taylor Swift, Dave Portnoy Calls It History’s Ultimate Upgrade",
        "description": "Travis Kelce has reasons to be extremely happy both on and off the football field. The Kansas City Chiefs tight end helped his squad bag an extraordinary win on Thursday at the Arrowhead Stadium. From the bleachers, his “good luck charm” and current girlfriend, Taylor Swift, cheered for him as he played against the formidable…The post As Patrick Mahomes’ Wife Celebrates Travis Kelce & Co.’s 19–8 Win With Taylor Swift, Dave Portnoy Calls It History’s Ultimate Upgrade appeared first on EssentiallySports."
    },
    {
        "title": "Unexpected Taylor Swift and Beyonce Crossover Fuels Serena Williams’ Former Coach With Emotions as Unveiled in a Stirring Message – ‘LFG Ladies’",
        "description": "Women empowerment has been one of the main goals of Serena Williams ever since she left tennis. But she is not alone in the move. Her former coach, Rennae Stubbs, also speaks for the move. She is passionate about the social movement and has often talked about it. Stubbs showed her dedication to it recently as…The post Unexpected Taylor Swift and Beyonce Crossover Fuels Serena Williams’ Former Coach With Emotions as Unveiled in a Stirring Message – ‘LFG Ladies’ appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift and Brittany Mahomes Fast Becoming Game Day BFFs",
        "description": "Taylor Swift has a new BFF in Brittany Mahomes while watching BF Travis Kelce's NFL games -- and there's video to prove it!! The pop star came out to see her favorite tight end, Travis, and his Kansas City Chiefs trounce the Denver Broncos 19-8 at…"
    },
    {
        "title": "TMZ: Taylor Swift, Travis Kelce Spending 'Entire Weekend Together' After Chiefs' Win",
        "description": "All the cynics and skeptics about Taylor Swift and Travis Kelce's relationship may not want to place want bets about it being entirely a public relations…"
    },
    {
        "title": "Exclusive: How Madonna inspired Taylor Swift and Beyonce — and outlived all of her peers",
        "description": "In honor of Madonna's 65th birthday, HELLO! spoke with with her biographer Mary Gabriel about the superstar's recent brush with death, her devotion to her family, and her legacy"
    },
    {
        "title": "Taylor Swift Could Earn Hundreds Of Millions From Her Movie–But It’s Only A Drop In The Bucket For Her",
        "description": "Taylor Swift might earn $100 million or more from her concert film...but she might earn billions from the tour itself."
    },
    {
        "title": "Deadpool 3 Filmmaker Drops A Taylor Swift Bombshell Amidst Travis Kelce’s Terrifying Blow",
        "description": "The Taylor mania has engulfed the NFL arena since the rumored relationship between Travis Kelce and Taylor Swift caught fire. Taylor Swift made her presence felt as she left tremors across the field in the extravagant events held at Arrowhead and Metlife. The game at the Arrowhead which the City Chiefs went on to win…The post Deadpool 3 Filmmaker Drops A Taylor Swift Bombshell Amidst Travis Kelce’s Terrifying Blow appeared first on EssentiallySports."
    },
    {
        "title": "Travis Kelce addresses “crazy” surge in interest in documentary since Taylor Swift dating rumours",
        "description": "The show recently became Prime Video’s most-watched documentary ever in the USThe post Travis Kelce addresses “crazy” surge in interest in documentary since Taylor Swift dating rumours appeared first on NME."
    },
    {
        "title": "Report: Taylor Swift Set to Attend Broncos vs. Chiefs amid Travis Kelce Dating Rumors",
        "description": "On the same night her concert film premiers in theaters worldwide, Taylor Swift is going to be attending her third football game in the past four weeks. Per…"
    },
    {
        "title": "Cineplex banks on concerts as Taylor Swift film breaks presale record",
        "description": "Swift's The Eras Tour film has already generated $6.2 million in presales for Cineplex"
    },
    {
        "title": "Taylor Swift And Travis Kelce Spending The Weekend Together",
        "description": "Taylor Swift and Travis Kelce are clearly goin' strong ... we've learned the 2 will be spending the entire weekend together after both scored some massive wins this week. Multiple sources familiar with the situation tell TMZ ... Taylor and Travis…"
    },
    {
        "title": "Travis Kelce responds to questions about rumoured Taylor Swift relationship",
        "description": "\"You’ve got a lot of people that care about Taylor, and for good reason\"The post Travis Kelce responds to questions about rumoured Taylor Swift relationship appeared first on NME."
    },
    {
        "title": "Travis Kelce’s Ex Speaks Out in Powerful Open Letter About ‘Backlash’ Amid His Taylor Swift Romance",
        "description": "Kayla Nicole penned her letter to Black women who were called a ‘traitor for falling in love.’ "
    },
    {
        "title": "What Happened To Taylor Swift’s Other Movie?",
        "description": "In December 2022, it was revealed that Taylor Swift had written an original script for a narrative full-length feature."
    },
    {
        "title": "Here Is The Runtime For Taylor Swift’s ‘The Eras Tour’ Movie",
        "description": "Getty Image Not long enough!"
    },
    {
        "title": "“Leave Her Alone”: Frustrated Fans Slam Kansas City Mayor for His Taylor Swift ‘Welcome Back’ Message",
        "description": "When Swifties scanned the US Bank Stadium for any sign of Taylor Swift, they were disappointed. In the Kansas City Chiefs vs. Minnesota Vikings game, Swift betrayed fans by missing what would have been her third appearance at a Chiefs game. And as luck would have it, that very game her rumored beau, TE Travis…The post “Leave Her Alone”: Frustrated Fans Slam Kansas City Mayor for His Taylor Swift ‘Welcome Back’ Message appeared first on EssentiallySports."
    },
    {
        "title": "After Kayla Nicole Breakup, Brittany Mahomes Could Embrace Friendship With $740M Taylor Swift And Singer Ciara",
        "description": "The Kansas City Chiefs are going stronger than ever. The enthralling Mahomes and Kelce duo is churning out incredible performances every week. Chiefs last game against the Vikings went on to show the capability both of the players possess. While Patrick Mahomes performed his best, as usual. Travis Kelce made all the news. Despite suffering…The post After Kayla Nicole Breakup, Brittany Mahomes Could Embrace Friendship With $740M Taylor Swift And Singer Ciara appeared first on EssentiallySports."
    },
    {
        "title": "Are you ready for it? Taylor Swift back at Arrowhead for Broncos-Chiefs",
        "description": "Taylor Swift made another Arrowhead Stadium appearance for Broncos vs. Chiefs on Thursday night, marking the songstress' third time attending a Kansas City game amid the Travis Kelce romance rumors."
    },
    {
        "title": "Despite Extending a Warm Hug With Millionaire Friend Taylor Swift, Brittany Mahomes Takes Six-Hour Detachment From Social Media",
        "description": "The Kansas City Chiefs are dishing out some serious pigskin justice against the Denver Broncos. These long-standing foes are duking it out for NFL supremacy in the thrilling Week 6 of the season. Now, the Broncos might be straying a bit off the playbook this year. Their head honcho, Sean Payton, has been catching heat…The post Despite Extending a Warm Hug With Millionaire Friend Taylor Swift, Brittany Mahomes Takes Six-Hour Detachment From Social Media appeared first on EssentiallySports."
    },
    {
        "title": "How Taylor Swift: The Eras Tour Was Turned Into a Movie",
        "description": "Movies like “Taylor Swift: The Eras Tour” rely on savvy tricks and sophisticated techniques to capture a semblance of the live experience."
    },
    {
        "title": "Sophie Turner Broke Her Social Media Silence After Announcing Her Split From Joe Jonas With A Taylor Swift-Inspired Photo",
        "description": "Getty Image How does Mr. Perfectly Fine feel about this?"
    },
    {
        "title": "Taylor Swift And Travis Kelce Lookalikes Will Be Everywhere, As Halloween Costumes Sell Out",
        "description": "They've already run out of over 800 Swift/Kelce costumes and are preparing for a new shipment"
    },
    {
        "title": "Taylor Swift effect? Cowboys-49ers 'Sunday Night Football' game delivers top NFL audience among women",
        "description": "Taylor Swift might be popular, but she's not as popular as the Dallas Cowboys."
    },
    {
        "title": "‘Taylor Swift: The Eras Tour’ film premiere shuts down The Grove shopping center — is Taylor coming?",
        "description": "All stores will be closed for the highly anticipated concert movie's debut — and amid the high security is the possibility that the singer herself could be there."
    },
    {
        "title": "Taylor Swift Eras Tour concert film in Chicago: Know before you go",
        "description": "Taylor Swift performs during “The Eras Tour” in Nashville, Tenn., on May 5, 2023. Swift is releasing her “Taylor Swift: The Eras Tour” concert film on Oct. 13. George Walker IV, AP Photos Taylor Swift is returning to Chicago — on the big screen, that is. The global sensation sold out three nights at Soldier Field for The Eras Tour in July, and now she’s selling out theaters across the city and suburbs with the tour’s concert film. In true Swift fashion, the movie premieres at 6 p.m. Oct. 13.Here are some things to know before you go:Where can you see The Eras Tour film in Chicago..."
    },
    {
        "title": "Travis Kelce addresses “crazy” surge in interest in documentary since Taylor Swift dating rumours",
        "description": "The show recently became Prime Video’s most-watched documentary ever in the USThe post Travis Kelce addresses “crazy” surge in interest in documentary since Taylor Swift dating rumours appeared first on NME."
    },
    {
        "title": "Here Are The Surprise Songs That Were Performed In Taylor Swift’s ‘The Eras Tour’ Movie",
        "description": "Getty Image Hint: Track 5."
    },
    {
        "title": "Cineplex banks on concerts as Taylor Swift film breaks presale record",
        "description": "Swift's The Eras Tour film has already generated $6.2 million in presales for Cineplex"
    },
    {
        "title": "Beyoncé Joins Taylor Swift At The Latter&#8217;s Concert Movie Premiere",
        "description": "Beyoncé Joins Taylor Swift At The Latter’s Concert Movie Premiere"
    },
    {
        "title": "Taylor Swift returns to Arrowhead Stadium to see Travis Kelce and the Chiefs face the Broncos",
        "description": "KANSAS CITY, Mo. (AP) — Pop superstar Taylor Swift was back at Arrowhead Stadium on Thursday night to watch Travis Kelce and the Kansas City Chiefs take on the Denver Broncos, one day after walking the red carpet at the premiere of her concert movie. Swift and Kelce have been in a budding relationship the […]"
    },
    {
        "title": "Taylor Swift seen with Travis Kelce's dad for the first time as relationship heats up",
        "description": "Looks like Taylor Swift’s relationship is getting more serious as she’s met both Travis Kelce’s parents at Kansas City Chiefs matches"
    },
    {
        "title": "WWE Women’s Champion Has a Hilarious Reaction to Seeing Taylor Swift at WrestleMania 40",
        "description": "It seems like the WWE cannot get enough of the pop star Taylor Swift. Weeks, after The Bump host Kayla Braxton fired shots at her for not taking the offer from NFL Travis Kelce, the pop icon’s name has risen again in the WWE. Iyo Sky vs Taylor Swift at WrestleMania 40 During the post-Fastlane press…The post WWE Women’s Champion Has a Hilarious Reaction to Seeing Taylor Swift at WrestleMania 40 appeared first on EssentiallySports."
    },
    {
        "title": "Amazon preparing for possibility of Taylor Swift attending Chiefs-Broncos game",
        "description": "If you haven’t gotten sick of Taylor Swift and Travis Kelce taking over your football viewing experience yet, you’re in luck; with the Kansas City Chiefs set to face the Denver Broncos on Thursday Night Football, the football world’s fascination with “Traylor” will have a night to itself this week. And while it has yet Read more...The post Amazon preparing for possibility of Taylor Swift attending Chiefs-Broncos game appeared first on Awful Announcing."
    },
    {
        "title": "Taylor Swift, Travis Kelce's Couples Halloween Costumes Sell Out Online",
        "description": "Folks who wanna be Taylor Swift and Travis Kelce can play make-believe on Halloween -- and it's a lock that lots of people will do just that, much to the joy of one costume shop raking in the dough. A rep for 3 Wishes, an online Halloween retailer,…"
    },
    {
        "title": "Where to watch ‘Taylor Swift: The Eras Tour’ in Southern California",
        "description": "Swifties, here's your guide to having a marvelous time watching Taylor Swift's Eras Tour at these Southern California movie theaters that never go out of style."
    },
    {
        "title": "Taylor Swift adelanta el estreno del su filme de su gira \"The Eras Tour\"",
        "description": "Taylor Swift anunció este miércoles que el estreno de su filme \"Taylor Swift: The Eras Tour\" se adelantaría al 12 de octubre en Estados Unidos y Canadá."
    },
    {
        "title": "“Leave Her Alone”: Frustrated Fans Slam Kansas City Mayor for His Taylor Swift ‘Welcome Back’ Message",
        "description": "When Swifties scanned the US Bank Stadium for any sign of Taylor Swift, they were disappointed. In the Kansas City Chiefs vs. Minnesota Vikings game, Swift betrayed fans by missing what would have been her third appearance at a Chiefs game. And as luck would have it, that very game her rumored beau, TE Travis…The post “Leave Her Alone”: Frustrated Fans Slam Kansas City Mayor for His Taylor Swift ‘Welcome Back’ Message appeared first on EssentiallySports."
    },
    {
        "title": "After Kayla Nicole Breakup, Brittany Mahomes Could Embrace Friendship With $740M Taylor Swift And Singer Ciara",
        "description": "The Kansas City Chiefs are going stronger than ever. The enthralling Mahomes and Kelce duo is churning out incredible performances every week. Chiefs last game against the Vikings went on to show the capability both of the players possess. While Patrick Mahomes performed his best, as usual. Travis Kelce made all the news. Despite suffering…The post After Kayla Nicole Breakup, Brittany Mahomes Could Embrace Friendship With $740M Taylor Swift And Singer Ciara appeared first on EssentiallySports."
    },
    {
        "title": "After Travis Kelce Gets “Butthurt” by Taylor Swift, Brother Jason Unveils Conspiracy Theory Behind Snub",
        "description": "Travis Kelce, TE for the Kansas City Chiefs, gets his heart broken off the field. The 33-year-old had been previously making the news after rumors of romantic linkings between him and a global pop star started surfacing. Kelce has been subjected to a lot of friendly teasing about the recent situation, both from fans and…The post After Travis Kelce Gets “Butthurt” by Taylor Swift, Brother Jason Unveils Conspiracy Theory Behind Snub appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift and her ‘Anti-Hero’ top MTV VMAs in a show dominated by hip-hop, K-pop and Latin jams",
        "description": "Taylor Swift took home the top prize at the 2023 MTV Video Music Awards for her “Anti-Hero” music video on a night full of surprises. Swift won four trophies on Tuesday's telecast, including song of the year, best pop video and best direction. As much as Swift dominated — she won nine awards — the VMAs centered on music’s global power. K-pop boy band Tomorrow X Together and Brazilian superstar Anitta premiered their new collaboration, the glossy retro-pop of “Back for More.” Shakira delivered a packed medley of her hits and accepted the Video Vanguard..."
    },
    {
        "title": "Periódicos de EEUU buscan reporteros especializados en Taylor Swift y Beyoncé",
        "description": "Esta semana la empresa de periódicos más grande de Estados Unidos publicó en su sitio dos ofertas de trabajo inusuales: Un reportero especializado en Taylor Swift y un reportero especializado en Beyoncé."
    },
    {
        "title": "Taylor Swift and her 'Anti-Hero' top MTV VMAs",
        "description": "Taylor Swift and her 'Anti-Hero' top MTV VMAs"
    },
    {
        "title": "NFL Announcer Sneaks in Taylor Swift Reference on Travis Kelce Touchdown",
        "description": "Travis Kelce is said to be \"hanging out\" with Taylor Swift -- something the NFL world just can't get enough of ... and which bled into Sunday's broadcast of his big game. NFL announcer Ian Eagle -- who called the Chiefs game Sunday -- snuck in a…"
    },
    {
        "title": "Not Taylor Swift or Beyonce, This Pop Star’s One Show Single-Handedly Broke WWE’s Biggest Record",
        "description": "Several pop musicians are currently on different tours. Levi’s Stadium is also caught up in the middle of this musical fest. The city of San Francisco saw various top artists performing at the Levi’s on tour. Even sensations like Beyonce and Taylor Swift gained attendees in huge numbers; 58,000 and 50,000 respectively. However, none of them comes even…The post Not Taylor Swift or Beyonce, This Pop Star’s One Show Single-Handedly Broke WWE’s Biggest Record appeared first on EssentiallySports."
    },
    {
        "title": "The Averageness of Taylor Swift",
        "description": "She’s completely unremarkable, and that’s precisely her appeal."
    },
    {
        "title": "The Daily Lowdown: Taylor Swift's concert film expected to bring in the big bucks",
        "description": "Taylor Swift's Eras concert film expected to bring in $100 million – find out when it's coming to the big screen"
    },
    {
        "title": "Taylor Swift’s ‘Eras Tour’ Film Could Become Highest Grossing Concert Film In Its Opening Weekend—Here’s The Top 10",
        "description": "Swift’s film could eclipse Justin Bieber: Never Say Never, which grossed $73 million in its opening weekend."
    },
    {
        "title": "The Loop Fantasy Football Update Week 2: Taylor Swift’s pal Kelce to return",
        "description": "It’s already been a big newsmaking week for Kansas City tight end Travis Kelce."
    },
    {
        "title": "Travis Kelce Reacts to NFL Commentator’s Epic Taylor Swift Puns Amid Romance Rumors",
        "description": "Travis Kelce knows all too well that his rumored romance with Taylor Swift has become a running joke with football experts — and he doesn't seem to mind it."
    },
    {
        "title": "Chiefs legend Tony Gonzalez forces Jason Kelce to address reports linking Travis Kelce to Taylor Swift",
        "description": "Chiefs legend Tony Gonzalez forces Jason Kelce to address reports linking Travis Kelce to Taylor Swift"
    },
    {
        "title": "Travis Kelce’s Brother Jason Plays Coy About Taylor Swift Rumors: ‘Trav Is Having Fun’",
        "description": "The Philadelphia Eagles center kept quiet on the dating rumors surrounding his younger brother during a post-game interview."
    },
    {
        "title": "Taylor Swift teases ‘From The Vault’ track from ‘1989 (Taylor’s Version)’",
        "description": "The pop star previously promised five previously unheard songs, which she described as \"insane\"The post Taylor Swift teases ‘From The Vault’ track from ‘1989 (Taylor’s Version)’ appeared first on NME."
    },
    {
        "title": "Joe Jonas' EXES Taylor Swift and Sophie Turner link arms as they party until 2am on a girls' night out in NYC amid shock divorce",
        "description": "Taylor Swift and Sophie Turner, two of Joe Jonas' exes, were seen strolling arm-in-arm as they appeared to be in good spirits during a girls night out in New York City on Tuesday."
    },
    {
        "title": "Taylor Swift And Travis Kelce Spending The Weekend Together",
        "description": "Taylor Swift and Travis Kelce are clearly goin' strong ... we've learned the 2 will be spending the entire weekend together after both scored some massive wins this week. Multiple sources familiar with the situation tell TMZ ... Taylor and Travis…"
    },
    {
        "title": "Fresh Rumors Suggest Travis Kelce And Taylor Swift Likely To Spend 48 Hours Together",
        "description": "We are living the moment in the Taylor Swift and Travis Kelce world right now. Taylor Swift is literally turning out to be the unofficial brand ambassador of the Chiefs. Even though the NFL never asked for, but would not mind a bit. What’s more, the whole NFL is going gaga over Taylor Swift. Tayor…The post Fresh Rumors Suggest Travis Kelce And Taylor Swift Likely To Spend 48 Hours Together appeared first on EssentiallySports."
    },
    {
        "title": "Hours After Shaking a Leg With Taylor Swift, $10M Worth Brittany’s White Outfit Sparks Intrigue",
        "description": "Brittany Mahomes was seen adopting Taylor Swift’s charm. After sharing a luxury suite with Taylor Swift at the game against the Kansas City Chiefs and the Denver Broncos, Brittany Mahomes is making waves for her outfit. Earlier, it was Swift who was in the news for her exquisite necklace, and now her companion of the…The post Hours After Shaking a Leg With Taylor Swift, $10M Worth Brittany’s White Outfit Sparks Intrigue appeared first on EssentiallySports."
    },
    {
        "title": "It Sure Looks Like ‘Hot Ones’ Is Teasing An Upcoming Episode With Taylor Swift",
        "description": "Taylor Swift/YouTube 'Hot Ones' might get its biggest guest yet."
    },
    {
        "title": "Taylor Swift’s ‘Eras Tour’ Film Rakes In Record Sales—Beating Concert Movies By Bieber, Michael Jackson And More",
        "description": "A film documenting Taylor Swift’s megatour earned nearly $93 million from North American theaters in its first weekend—making it the biggest concert movie of all time."
    },
    {
        "title": "Taylor Swift Affectionately Hugs Brittany; Netizens State Patrick Mahomes’ Wife Found a ‘Bestie’",
        "description": "The Kansas City Chief‘s quarterback Patrick Mahomes and the only tight end Travis Kelce share a close bond with each other off-court as well. However, Patrick’s superwife, Brittany Mahomes and Kelce’s lady love are forming the same bond with one another. Viewers saw the duo hugging each other tight during the latest Chiefs match. After…The post Taylor Swift Affectionately Hugs Brittany; Netizens State Patrick Mahomes’ Wife Found a ‘Bestie’ appeared first on EssentiallySports."
    },
    {
        "title": "Movie Review: ‘Taylor Swift: The Eras Tour’",
        "description": "In a world of ultra-raunchy rap and the obscenity-laden lyrics often found even outside that genre, Taylor Swift shows considerable moderation."
    },
    {
        "title": "Chiefs’ Travis Kelce Gives Details on Busy Weekend With Taylor Swift",
        "description": "The Kansas City tight end and musician both had cameos in Saturday Night Live's season premiere."
    },
    {
        "title": "BYU basketball: What do Cougars have in common with Taylor Swift?",
        "description": "BYU coach Mark Pope addresses the media during Big 12 men’s basketball media day on Wednesday, Oct. 18, 2023, in Kansas City, Mo.Charlie Riedel, Associated Press KANSAS CITY, Mo. — After fifth-year BYU basketball coach Mark Pope addressed the media from the dais at the Big 12 Men’s Basketball Tipoff on Wednesday morning at the T-Mobile Center in downtown Kansas City, one local reporter here approached another and asked if he had BYU’s coach talking about Taylor Swift’s favorite number on his bingo card. “We could not be more excited to be here. This has been 100 years in the making..."
    },
    {
        "title": "Taylor Swift Tickets For Her Eras Tour Are Back On Sale—Don’t Miss Out This Time",
        "description": "You won't want to miss the \"journey through the musical eras\" of her past 10 albums."
    },
    {
        "title": "$740M Worth Taylor Swift’s Popcorn Bucket Costs $308 More Than Rumored Love Interest Travis Kelce’s Jersey",
        "description": "Taylor Swift and Travis Kelce are emerging as market influencers. Taylor Swift began her Eras Tour this year on March 17th. But little did Swifties and football enthusiasts know that both industries would intertwine this season. These alleged dating partners crossed paths in July. After the Kansas City Chiefs tight end attempted to gift a…The post $740M Worth Taylor Swift’s Popcorn Bucket Costs $308 More Than Rumored Love Interest Travis Kelce’s Jersey appeared first on EssentiallySports."
    },
    {
        "title": "How To Get Tickets For Taylor Swift’s ‘The Eras Tour’ Concert Film",
        "description": "Getty Image Swift said the tour has been 'the most meaningful, electric experience of my life so far.'"
    },
    {
        "title": "The Daily Lowdown: Taylor Swift announces huge news that fans will love",
        "description": "Taylor Swift has announced some major news that her fans will love. Find out more details here…"
    },
    {
        "title": "Taylor Swift Announces an ‘Eras Tour’ Film and AMC Shares Soar",
        "description": "AMC Entertainment Holdings Inc. shares rise after pop star Taylor Swift announced that her recent “Eras Tour” will screen in North American cinemas starting in October."
    },
    {
        "title": "Taylor Swift’s ‘The Eras Tour’ concert film is coming to theaters Oct. 13",
        "description": "The first three nights of Swift's six-evening run at SoFi Stadium in Inglewood in early August were recorded for the concert film."
    },
    {
        "title": "Taylor Swift’s ‘The Eras Tour’ concert film is coming to theaters Oct. 13",
        "description": "The first three nights of Swift's six-evening run at SoFi Stadium in Inglewood in early August were recorded for the concert film."
    },
    {
        "title": "Taylor Swift Has Singles From Five Different Albums Charting On One Billboard Chart",
        "description": "She has eight songs on the chart, but they're from five different releases. Swift might be the first artist to manage this incredible feat."
    },
    {
        "title": "Taylor Swift enters her movie theater ‘Era’ as she brings record-breaking tour to the big screen",
        "description": "Taylor Swift is bringing her “Eras Tour” to a movie theater near you starting this October; the singer announced in an Instagram post Thursday morning.The post Taylor Swift enters her movie theater ‘Era’ as she brings record-breaking tour to the big screen appeared first on ABC7 Southwest Florida."
    },
    {
        "title": "Missed out on Taylor Swift’s Eras Tour? Catch it in Canadian theatres",
        "description": "Taylor Swift is bringing her hugely popular Eras Tour to 150 Cineplex locations in Canada."
    },
    {
        "title": "The Weeknd Celebrates Taylor Swift Earning 100 Million Monthly Spotify Listeners",
        "description": "For a while, The Weeknd was the only artist to have clinched 100 million monthly Spotify listeners. Now, he is joined by Taylor Swift – who just can’t seem to stop breaking records. To help celebrate Swift’s milestone, The Weeknd shared a congratulatory post to his Instagram story, featuring a photo of both artists at […]The post The Weeknd Celebrates Taylor Swift Earning 100 Million Monthly Spotify Listeners appeared first on American Songwriter."
    },
    {
        "title": "Taylor Swift references Kanye West VMAs incident during ‘Eras’ tour",
        "description": "She seemingly made light of the infamous 2009 mishap while performing in MexicoThe post Taylor Swift references Kanye West VMAs incident during ‘Eras’ tour appeared first on NME."
    },
    {
        "title": "Taylor Swift Seemingly Nodded To The Infamous Kanye West VMAs Incident With An On-Stage Joke",
        "description": "Getty Image Fans think a Swift quip was a reference to the infamous moment."
    },
    {
        "title": "Exorswift: Taylor Swift concert film will open in theaters same day as new 'Exorcist' movie",
        "description": "A concert film of Taylor Swift's \"Eras Tour\" will hit theaters on October 13, going up against the release date of horror flick \"The Exorcist: Believer.\""
    },
    {
        "title": "Taylor Swift’s ‘The Eras Tour’ Movie Prompted AMC, Wary Of A Ticketmaster-Style Mess, To Make Huge Ticketing System Upgrades",
        "description": "Karma's a relaxing thought for Taylor Swift, but not so much for Ticketmaster."
    },
    {
        "title": "Taylor Swift Becomes The First Woman To Hit A Major Milestone On Spotify",
        "description": "August 2023 has turned out to be perhaps Swift's biggest month ever on Spotify."
    },
    {
        "title": "Taylor Swift Announces Eras Tour Concert Film",
        "description": "Good news, Swifties! Taylor Swift has just announced that she’ll be releasing “Taylor Swift: The Eras Tour,” a concert film of her Eras tour. She wrote on her social media accounts, “The Eras Tour has been the most meaningful, electric experience of my life so far and I’m overjoyed to tell you that it’ll be coming to the big screen soon. Starting Oct 13th you’ll be able to experience the concert film in theaters in North America! Tickets are on sale now at amctheatres.com. Eras attire, friendship bracelets, singing and dancing encouraged… 1, 2, 3 LGB!!!! (iykyk).” Taylor also..."
    },
    {
        "title": "Taylor Swift’s ‘The Eras Tour’ concert film is coming to theaters Oct. 13",
        "description": "The first three nights of Swift's six-evening run at SoFi Stadium in Inglewood in early August were recorded for the concert film."
    },
    {
        "title": "Taylor Swift’s ‘The Eras Tour’ concert film is coming to movie theaters Oct. 13",
        "description": "The first three nights of Swift's six-evening run at SoFi Stadium in Inglewood in early August were recorded for the concert film."
    },
    {
        "title": "Seeing ‘Red’ after Taylor Swift debacle, lawmakers weigh new policies",
        "description": "There’s no question what motivated state Rep. Kelly Moller to push for changes in Minnesota law on concert ticket sales. “Really, it was the Taylor Swift debacle for me,” she said. A self-professed Swiftie, the Democrat found herself among millions of other Americans unable to buy tickets last year to Swift’s Eras Tour. She preregistered for tickets, but never received a code to buy them. And on the day sales went live online, she sat by as friends with codes got bumped out of the ticket queue for no apparent reason. Then Ticketmaster’s website crashed. The ordeal convinced her that..."
    },
    {
        "title": "‘Cruel Summer’ into fun fall: Taylor Swift concert movie coming in October",
        "description": "“Taylor Swift | The Eras Tour” will continue in movie theaters beginning in October"
    },
    {
        "title": "Gigi Hadid and Bradley Cooper Reportedly Staying at Taylor Swift’s Rhode Island Home Amidst Romance",
        "description": "The rumored couple is reportedly enjoying their 'casual romance' at the 'Holiday House' featured in one of Taylor Swift's 'folklore' tunes."
    },
    {
        "title": "Taylor Swift's Eras tour movie has fans flocking to cinema to buy branded popcorn buckets and plastic bottles - and sell them on for up to £200",
        "description": "The US superstar, 33, debuted the three-hour film of her record-breaking tour at UK cinemas on Friday."
    },
    {
        "title": "The ‘Only Presidential Candidate Who Can Unite The Country’ Is… Taylor Swift, Grimes Believes",
        "description": "Getty Image 'Trump v Swift is totally occurring in a parallel universe rn.'"
    },
    {
        "title": "Mario Lopez Talks Sneakers, Taylor Swift and Celebrities",
        "description": "The actor and two-time Emmy-winning host is nearing his 40th year in the entertainment industry."
    },
    {
        "title": "Travis Kelce Is Reportedly \"Very, Very Happy\" With Taylor Swift",
        "description": "It's a love story."
    },
    {
        "title": "Taylor Swift and Travis Kelce âincapable of keeping hands off each other at SNL!â (Entertainment)",
        "description": "Taylor Swift and Travis Kelce are said to have been incapable of “keeping their hands off each other” at ‘Saturday Night Live’. The singer, 33, and the Kansas City Chiefs player, 34, have been linked since she was spotted cheering him on at The Arrowhead Stadium on 23 Septem..."
    },
    {
        "title": "Taylor Swift Affectionately Hugs Brittany; Netizens State Patrick Mahomes’ Wife Found a ‘Bestie’",
        "description": "The Kansas City Chief‘s quarterback Patrick Mahomes and the only tight end Travis Kelce share a close bond with each other off-court as well. However, Patrick’s superwife, Brittany Mahomes and Kelce’s lady love are forming the same bond with one another. Viewers saw the duo hugging each other tight during the latest Chiefs match. After…The post Taylor Swift Affectionately Hugs Brittany; Netizens State Patrick Mahomes’ Wife Found a ‘Bestie’ appeared first on EssentiallySports."
    },
    {
        "title": "Travis Kelce Enjoys Night Out With Brother Jason After Confirming Taylor Swift Romance",
        "description": "The Kelce brothers went to the Philadelphia Phillies baseball game after Travis had an enchanting weekend with Taylor Swift in New York City."
    },
    {
        "title": "The steel-and-concrete co-star of the Taylor Swift 'Eras' movie? Inglewood's SoFi Stadium",
        "description": "In a few years, SoFi Stadium has been the site of a historic Super Bowl halftime show, a Weeknd concert doc and now, the top-grossing concert film of all time."
    },
    {
        "title": "Travis Kelce Dating Saga Seemingly Helps Taylor Swift Edge Past Justin Bieber",
        "description": "Chart-topping sensation Taylor Swift and the NFL powerhouse Travis Kelce have been the epicenter of a media frenzy for weeks now. Even though they are yet to officially confirm their romantic involvement, their rumored connection has stirred a whirlwind of attention which has significantly shaped the trajectories of their careers. This romantic saga has propelled…The post Travis Kelce Dating Saga Seemingly Helps Taylor Swift Edge Past Justin Bieber appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift and Travis Kelce Are Very Hands-On for Second NYC Date Night",
        "description": "Taylor Swift and Travis Kelce are on a roll, hitting the Big Apple two nights in a row ... and showing some major PDA!! The world's most famous couple was filmed strolling out of the Waverly Inn restaurant in Manhattan's Greenwich Village Sunday…"
    },
    {
        "title": "Post Malone says Taylor Swift told him ‘Better Now’ is “fucking amazing”",
        "description": "\"That was a really cool moment and it was very inspiring\"The post Post Malone says Taylor Swift told him ‘Better Now’ is “fucking amazing” appeared first on NME."
    },
    {
        "title": "Movie Review: ‘Taylor Swift: The Eras Tour’",
        "description": "In a world of ultra-raunchy rap and the obscenity-laden lyrics often found even outside that genre, Taylor Swift shows considerable moderation."
    },
    {
        "title": "The Daily Lowdown: Taylor Swift drops huge news that fans will love – get the details",
        "description": "Taylor Swift thanked her fans for their support of the Eras World Tour film with two surprise releases – get the details on HELLO!'s Daily Lowdown…"
    },
    {
        "title": "Report: Taylor Swift, Travis Kelce 'Are All in' on Relationship amid Dating Rumors",
        "description": "Things are reportedly getting pretty serious between Kansas City Chiefs All-Pro tight end Travis Kelce and global music megastar Taylor Swift. According to…"
    },
    {
        "title": "Christopher Nolan calls Taylor Swift’s ‘The Eras Tour’ movie distribution an “incredible lesson” for studios",
        "description": "Swift’s concert film broke the records for the highest-grossing concert film or documentary of all timeThe post Christopher Nolan calls Taylor Swift’s ‘The Eras Tour’ movie distribution an “incredible lesson” for studios appeared first on NME."
    },
    {
        "title": "Taylor Swift is Attending Week 7 Chargers-Chiefs Game, Confirmed by a Bernie Kosar Selfie",
        "description": "Of all the people Swift could pose for a selfie with, who would guess this?"
    },
    {
        "title": "Chiefs score and Taylor Swift and Brittany Mahomes do their new celebration handshake",
        "description": "There was another viral Taylor Swift moment on Sunday."
    },
    {
        "title": "Ice Spice Dons Draped Diesel Set, Taylor Swift Goes Gothic in Versace Corset on ‘Saturday Night Live’",
        "description": "Swift made a cameo to introduce Spice's performance of \"Pretty Girl.\""
    },
    {
        "title": "Taylor Swift’s Security Guard Returns to Israel to Fight Hamas: ‘Don’t Be on the Wrong Side of History’",
        "description": "The bodyguard — whose name has not been disclosed to the public — reportedly flew back to his home country to help their fight against Hamas. "
    },
    {
        "title": "Tell them how the crowds went wild for ‘Taylor Swift: The Eras Tour’",
        "description": "Friday, Oct. 13, is often considered an unlucky day, with superstitions and spirits swirling on people’s minds. But for Taylor Swift, it marked the widespread release of her newest project, “Taylor Swift: The Eras Tour.” The concert movie premiered in theaters with record-shattering numbers, officially  heralded as the highest grossing domestic debut for a concert...The post Tell them how the crowds went wild for ‘Taylor Swift: The Eras Tour’ appeared first on The Quinnipiac Chronicle."
    },
    {
        "title": "Taylor Swift Tickets For Her Eras Tour Are Back On Sale—Don’t Miss Out This Time",
        "description": "You won't want to miss the \"journey through the musical eras\" of her past 10 albums."
    },
    {
        "title": "Taylor Swift's $150m property portfolio is out of this world: from New York to Nashville",
        "description": "The star of sell-out hit Taylor Swift: The Eras Tour movie Taylor Swift owns houses in Nashville, Rhode Island, Beverly Hills, and New York - take a peek inside as her Travis Kelce romance blossoms"
    },
    {
        "title": "Watch – Boyfriend Travis Kelce Turns Musician for Dazzling Taylor Swift Who Wrote 114 Songs Solo",
        "description": "Travis Kelce is reportedly turning “Romeo” of the NFL. The “Love Story” singer Taylor Swift and the Kansas City Chiefs tight end Kelce were recently spotted at the SNL studio and at a private dinner in New York City. The alleged couple were reportedly seen holding hands with each other, who came to attend a…The post Watch – Boyfriend Travis Kelce Turns Musician for Dazzling Taylor Swift Who Wrote 114 Songs Solo appeared first on EssentiallySports."
    },
    {
        "title": "All you need to know about Taylor Swift's famous brother, Austin Swift",
        "description": "We all know Taylor Swift was born in 1989, but what is there to know about her brother who was born two years later? Learn about Austin Swift here"
    },
    {
        "title": "Lakers HC Reignites Taylor Swift Rumors For Austin Reaves, Hysterically Hailing 25YO Star For Saying “No”",
        "description": "The Los Angeles Lakers pre-season received a sudden twist after public comments from their head coach. His statement surrounding Austin Reaves fueled an ongoing drama related to the latter’s personal life. The 25-year-old star’s dating rumors with Taylor Swift got rekindled following the comments. Despite reaching a conclusion, the saga seemed to have no end…The post Lakers HC Reignites Taylor Swift Rumors For Austin Reaves, Hysterically Hailing 25YO Star For Saying “No” appeared first on EssentiallySports."
    },
    {
        "title": "Movie Review: In the elated ‘Taylor Swift: The Eras Tour,’ every seat is the best seat in the house",
        "description": "This is the moment it should become clear: \"Taylor Swift: The Eras Tour\" film is a near exact replica of her blockbuster concert performance, which recaps all 10 of her studio albums across 17 years of recorded work. There will be no narrative breaks, no behind-the-scenes footage, no additional ornamentation of the monolithic set (with the exception of a few CGI effects and album title cards to introduce each epoch.) The film delivers on the promise of its title: this is the Eras Tour in full — conveniently viewable at an AMC theater near you."
    },
    {
        "title": "Taylor Swift Makes Billion-Dollar Impact Before Travis Kelce Date Night",
        "description": "Taylor Swift‘s mania has engulfed the NFL arena completely. Since the rumors about Travis Kelce and Taylor Swift popped up, fans are not leaving any stone unturned to get a glimpse of their favorite alleged couple. She had made her impact felt as she visited three of the last four games played by the Chiefs.…The post Taylor Swift Makes Billion-Dollar Impact Before Travis Kelce Date Night appeared first on EssentiallySports."
    },
    {
        "title": "Post Malone Revealed What Taylor Swift Is Like Behind the Scenes During an Interview with Howard Stern",
        "description": "Taylor Swift is everywhere you look right now. Her Eras Tour, the resulting concert film, and her relationship with Travis Kelce have dominated headlines. Recently, Post Malone shared his opinion on Swift and her success. Yesterday, October 17, Malone appeared on Howard Stern’s SiriusXM show. Eventually, the conversation turned to Swift. Posty recalled a chance […]The post Post Malone Revealed What Taylor Swift Is Like Behind the Scenes During an Interview with Howard Stern appeared first on American Songwriter."
    },
    {
        "title": "BYU basketball: What do Cougars have in common with Taylor Swift?",
        "description": "BYU coach Mark Pope addresses the media during Big 12 men’s basketball media day on Wednesday, Oct. 18, 2023, in Kansas City, Mo.Charlie Riedel, Associated Press KANSAS CITY, Mo. — After fifth-year BYU basketball coach Mark Pope addressed the media from the dais at the Big 12 Men’s Basketball Tipoff on Wednesday morning at the T-Mobile Center in downtown Kansas City, one local reporter here approached another and asked if he had BYU’s coach talking about Taylor Swift’s favorite number on his bingo card. “We could not be more excited to be here. This has been 100 years in the making..."
    },
    {
        "title": "Travis Kelce sets the record straight on his NYC weekend with Taylor Swift",
        "description": "(CNN) — At least we can now definitely say Travis Kelce has been going out on dates with Taylor Swift."
    },
    {
        "title": "Taylor Swift's Movie Accounted For 70% Of Box Office Grosses In America This Weekend",
        "description": "Taylor Swift’s film was reportedly responsible for 70% of box office grosses this past weekend."
    },
    {
        "title": "Taylor Swift’s New Flame Experiences “Rocking” Phillies Fans as Brotherly Outing Turns Epic With Philadelphia Clinching Crucial NLCS Win",
        "description": "In a shocking turn of events, the dynamic duo of Travis and Jason Kelce made an appearance at the NLCS game at Citizens Bank Park on Monday. The brothers took some time off from the field, amid the buzz surrounding Travis and Taylor Swift’s reported relationship. It’s been a wild year for baseball and football…The post Taylor Swift’s New Flame Experiences “Rocking” Phillies Fans as Brotherly Outing Turns Epic With Philadelphia Clinching Crucial NLCS Win appeared first on EssentiallySports."
    },
    {
        "title": "REVIEW: &#8220;Taylor Swift: The Eras Tour” provides dazzling view of “The Eras Tour”",
        "description": "For most ticketless fans, the only way to experience Taylor Swift’s “The Eras Tour” is through shaky livestreams and videos. With the release of the concert film “Taylor Swift: The Eras Tour,” fans finally have their long-awaited access to the best seats in the house.But “Taylor Swift: The Eras Tour” isn’t just a movie: It’s an experience.The experience begins before one even walks into the theater. Dotted in the concession lines were fans in “The Eras Tour” outfits. For instance, someone was dressed in all key lime green, a nod to a line from “The Last Great..."
    },
    {
        "title": "Travis Kelce Jokes About Taylor Swift's 'Terrifying' Conversation With Dad",
        "description": "Travis Kelce was shaking in his boots when Taylor Swift came face-to-face with his dad, Ed, during his Thursday Night Football matchup last week ... admitting he has no idea what the two talked about -- and he's concerned. The Kansas City Chiefs…"
    },
    {
        "title": "Chiefs’ Travis Kelce Gives Details on Busy Weekend With Taylor Swift",
        "description": "The Kansas City tight end and musician both had cameos in Saturday Night Live's season premiere."
    },
    {
        "title": "Travis Kelce Shifts $995,000,000 Worth Kansas Home to Embrace Million-Dollar Luxury; Taylor Swift Could Visit Him Soon",
        "description": "Travis Kelce has traded his tight-end skills for some sweet romance yardage. And the Kansas City Chiefs star is playing in the love game like a seasoned pro. The rumor mill went on overdrive when it seemed he was cozying up with pop sensation Taylor Swift. Cue a whole month of tabloid whispers, paparazzi flashes…The post Travis Kelce Shifts $995,000,000 Worth Kansas Home to Embrace Million-Dollar Luxury; Taylor Swift Could Visit Him Soon appeared first on EssentiallySports."
    },
    {
        "title": "Can you spot what is wrong with this photo of Taylor Swift? Fans shocked to see popstar's VERY different look",
        "description": "Taylor Swift fans were left stunned after a photo of the singer looking very different went viral on Thursday."
    },
    {
        "title": "Taylor Swift Arrives With a Smile At Iconic Arrowhead Stadium, Clad in Kansas City Chiefs’ Jersey",
        "description": "The Chiefs are as undefeated as the Swifties. But is all that about to change? Pictures surfaced online which disappointed many Swifties. The Chiefs won the game against the Vikings even though Taylor did not attend the match at US Bank Stadium in Minnesota. But Taylor has never missed a Chiefs home game. Will the…The post Taylor Swift Arrives With a Smile At Iconic Arrowhead Stadium, Clad in Kansas City Chiefs’ Jersey appeared first on EssentiallySports."
    },
    {
        "title": "It Sure Looks Like ‘Hot Ones’ Is Teasing An Upcoming Episode With Taylor Swift",
        "description": "Taylor Swift/YouTube 'Hot Ones' might get its biggest guest yet."
    },
    {
        "title": "Taylor Swift’s Movie Outsold The Next 50 Top-Grossing Movies Combined",
        "description": "Taylor Swift: The Eras Tour actually outsold the rest of the top 50 grossing movies in America this past weekend—combined—with room to spare."
    },
    {
        "title": "Who Does Taylor Swift Need To Beat For ‘Cruel Summer’ To Hit No. 1?",
        "description": "While all signs point to “Cruel Summer” becoming the next No. 1 on the Hot 100, nothing is certain until Billboard announces the winner."
    },
    {
        "title": "Fans swarmed a Connecticut restaurant looking for Taylor Swift. They found her scarecrow instead.",
        "description": "Hundreds of fans crowded outside Elm restaurant in New Canaan for hours amid rumors that Taylor Swift and Travis Kelce were dining there for lunch.The post Fans swarmed a Connecticut restaurant looking for Taylor Swift. They found her scarecrow instead. appeared first on Boston.com."
    },
    {
        "title": "Taylor Swift Took A Big Swing With Her ‘The Eras Tour’ Movie–And It Worked Beautifully",
        "description": "It would have been incredibly easy for Taylor Swift to sell her concert film to a streamer, but she made much more money sending it to theaters instead."
    },
    {
        "title": "Kelly Clarkson defends herself after alleged criticism of Taylor Swift and Travis Kelce's romance",
        "description": "Kelly Clarkson has shown her support for Taylor Swift and Kansas City Chiefs star Travis Kelce's romance amid allegations she had criticized the pair. Find out what she said and how she responded..."
    },
    {
        "title": "Taylor Swift’s Mega Influence Reaches Serena Williams’ Family as ‘Swiftie’ Daughter Olympia Makes ‘The Red Team’ Declaration",
        "description": "When two global icons intersect, magic happens. But what if it’s not just their worlds, but their families, too? Tennis legend Serena Williams has always showcased her admiration for pop sensation Taylor Swift. Now, Serena’s daughter, Olympia, is following suit. How deep do the ties between these two powerful women run? And what’s the whimsical…The post Taylor Swift’s Mega Influence Reaches Serena Williams’ Family as ‘Swiftie’ Daughter Olympia Makes ‘The Red Team’ Declaration appeared first on EssentiallySports."
    },
    {
        "title": "Legendary Rob Gronkowski Unmasks Travis Kelce’s “Unbelievable” Quality Which Caught Taylor Swift’s Attention to Spark the Romance",
        "description": "Pop sensation, Taylor Swift and the Chief’s tight end, Travis Kelce had not been spotted together since her initial appearance at one Kansas City Chiefs game in late September. However, their recent reunion over the weekend suggests that Traylor is here to stay! And one NFL legend wants to have them even closer! Former NFL…The post Legendary Rob Gronkowski Unmasks Travis Kelce’s “Unbelievable” Quality Which Caught Taylor Swift’s Attention to Spark the Romance appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift's Security Guard Heads Home To Israel, Joins IDF Fight Against Hamas",
        "description": "Taylor Swift's security guard, who went viral for how well he protected the singer during her \"Eras\" tour, is back home in Israel ... joining the army in the fight against Hamas terrorists. The singer's bodyguard flew back to the Middle East amid…"
    },
    {
        "title": "Taylor Swift’s ‘Eras Tour’ Film Rakes In Record Sales—Beating Concert Movies By Bieber, Michael Jackson And More",
        "description": "A film documenting Taylor Swift’s megatour earned nearly $93 million from North American theaters in its first weekend—making it the biggest concert movie of all time."
    },
    {
        "title": "Who Is ‘All Too Well’ About? Everything to Know About Taylor Swift’s Famous Breakup Song",
        "description": "Swifties love nothing more than decoding who a Taylor Swift song is about, and 'All Too Well' has become a widespread fan favorite — especially since there are so many clues as to who the subject is!"
    },
    {
        "title": "Taylor Swift's Eras Tour movie was big at the box office. Here are some takeaways",
        "description": "Taylor Swift's Eras Tour concert movie posted huge box office numbers (though not as huge as some forecast). What are the takeaways?"
    },
    {
        "title": "Travis Kelce and Taylor Swift: Actually Moving In Together?!?",
        "description": "Travis Kelce and Taylor Swift clearly get along very well. But well enough to take a major step in their relationship???Travis Kelce and Taylor Swift: Actually Moving In Together?!? was originally published on The Hollywood Gossip."
    },
    {
        "title": "Chiefs star Travis Kelce buys new Kansas City home amid rumored romance with Taylor Swift: reports",
        "description": "Two-time Super Bowl winner Travis Kelce appears to be stepping up his privacy amid his rumored relationship with pop star Taylor Swift.Swift has appeared at multiple Kansas City Chiefs games this season. Swift and Kelce also made separate, surprise appearances on the season premiere of \"Saturday Night Live.\" The possible romance has brought increased attention to Kelce, which may have prompted the NFL star to seek out a more private home. Kelce's current home is not gated, but according to the Kansas City Business Journal, he is purchasing a $6 million mansion that is much less accessible to..."
    },
    {
        "title": "Fans Roast NFL Broadcasters For Shocking Stat Comparisons Featuring Travis Kelce and Taylor Swift",
        "description": "Once again, Taylor Swift shocked her fans by sparing some of her precious time to attend a Kelce game. The NFL community was first captivated by the pop icon Taylor Swift in the second week when the Chiefs destroyed the Bears 41-10. The Chiefs were down 21–20 against the Lions in their opening game, but…The post Fans Roast NFL Broadcasters For Shocking Stat Comparisons Featuring Travis Kelce and Taylor Swift appeared first on EssentiallySports."
    },
    {
        "title": "Olivia Rodrigo Reacts to Theory 'Vampire' Is About Taylor Swift",
        "description": "Olivia Rodrigo has responded to fan theories her single \"Vampire\" is about none other than Taylor Swift. The 20-year-old seemed to be taking a page out of Swift's own cryptic songbook as she began by noting, in an interview with The Guardian, \"I mean, I never want to say who any of my songs are about. I've never done that before in my career and probably won't. I think it's better to not pigeonhole a song to being about this one thing.\" The former Disney Channel star then added, \"I was very surprised when people thought that.\" The particular lyrics in the song \"Livies\" believe are about Swift..."
    },
    {
        "title": "Taylor Swift shouts out Griff’s new song ‘Vertigo’",
        "description": "The former NME Award-winner shared her disbelief at the mentionThe post Taylor Swift shouts out Griff’s new song ‘Vertigo’ appeared first on NME."
    },
    {
        "title": "“RIP Jimmy”- Hillary Clinton, Dale Earnhardt Jr Join Millions in Mourning Tragic Demise of Billionaire Music Icon With More #1 Hits Than Taylor Swift & Beyonce Combined",
        "description": "It is never pleasant news whenever a demise comes to light. Just days ago, Tony Stewart lost one of his drivers Ashlea Albertson is one of the most unexpected fashions. Stewart-Haas Racing driver Ryan Preece was lucky to survive a violent and fatal crash at Daytona last week. While the NASCAR community was fortunate to…The post “RIP Jimmy”- Hillary Clinton, Dale Earnhardt Jr Join Millions in Mourning Tragic Demise of Billionaire Music Icon With More #1 Hits Than Taylor Swift & Beyonce Combined appeared first on EssentiallySports."
    },
    {
        "title": "Watch Counting Crows cover ‘The 1’ by Taylor Swift",
        "description": "Adam Duritz previously revealed that he had been \"obsessing\" over Swift's music in recent monthsThe post Watch Counting Crows cover ‘The 1’ by Taylor Swift appeared first on NME."
    },
    {
        "title": "Some Ottawa residents lose up to $2,000 in fake Taylor Swift tickets: police",
        "description": "Ottawa police say they've seen an increase in reports of fake ticket sales for Taylor Swift's sold out Toronto shows due to what they're describing as online ticket scams."
    },
    {
        "title": "WATCH: Mookie Betts’ Emotional Moment With Kobe Bryant’s Daughter and Taylor Swift Favorite Will Leave You in Tears",
        "description": "The Los Angeles Lakers star Kobe Bryant’ has a legendary status in the sporting world. He achieved greatness on the hard court that continues to inspire people. Although Bryant is no longer in the world to add more to his inspirational journey but continues to be part of daily life as a forever memory. Given…The post WATCH: Mookie Betts’ Emotional Moment With Kobe Bryant’s Daughter and Taylor Swift Favorite Will Leave You in Tears appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift's Banner Won't Return to Crypto.com Rafters for Lakers, Clippers Games",
        "description": "Taylor Swift's banner will not be returning to the rafters at Crypto.com Arena any time soon. The banner, which Kobe Bryant presented to Swift for her 16…"
    },
    {
        "title": "I paid £200 for my Taylor Swift ticket and now I'm being told I can't go - because the seat's behind the stage!': Swifties blast Ticketmaster after discovering they're NOT going to sell-out Wembley gig in latest humiliation for ticket site",
        "description": "Tickets for Taylor Swift Eras gig at Wembley, which they bought via Ticketmaster have been refunded because the seats are unavailable as they are behind the stage."
    },
    {
        "title": "After outrage over Taylor Swift tickets, reform has been slow across the US",
        "description": "\"That's it? That's all that California, the leading state in the nation on so many consumer protection issues, that's all we're going to do?\" said Robert Herrell, executive director of the Consumer Federation of California. \"That's an embarrassment. It's not enough.\""
    },
    {
        "title": "Taylor Swift’s Concert Film Has Already Earned Back Its Budget–Before It’s Even Opened",
        "description": "The film reportedly cost up to $20 million to make, and it earned that back in pre-sales in less than a day."
    },
    {
        "title": "The Daily Lowdown: Taylor Swift shares very rare personal video with fans",
        "description": "Taylor Swift and Jack Antonoff appeared in a rare and personal video with fans on her Instagram to thank her fans for the success of Cruel Summer, which has reached the number one spot on the Hot 100…"
    },
    {
        "title": "Taylor Swift’s No. 1s: Here Are All Of Her Songs That Topped The ‘Billboard’ Hot 100",
        "description": "Getty Image Swift recently added another to her hits with 'Cruel Summer' reaching No. 1."
    },
    {
        "title": "Here’s When Taylor Swift’s ‘1989 (Taylor’s Version)’ Will Be On Spotify",
        "description": "Getty Image Swift's next re-recorded album is almost out."
    },
    {
        "title": "From country to pop, 2014 nostalgia to 2023 reality — it's time for Taylor Swift's '1989'",
        "description": "From country to pop, 2014 nostalgia to 2023 reality — it's time for Taylor Swift's '1989'"
    },
    {
        "title": "Taylor Swift is now a billionaire – her epic net worth revealed",
        "description": "Taylor Swift net worth: the singer is reported to have reached billionaire status thanks to her Eras tour"
    },
    {
        "title": "Taylor Swift swerves expectations again with new 1989 track “Slut!”",
        "description": "The prologue to 1989 (Taylor’s Version) explains exactly the kind of scrutiny that the original 1989 album was made under. “I had become the target of slut shaming—the intensity and relentlessness of which would be criticized and called out if it happened today,” Taylor Swift writes. “The jokes about my amount of…Read more..."
    },
    {
        "title": "“This Is Freaking Adorable”: Deion Sanders’ “Troublesome” Business Partner Swoons Over Taylor Swift’s Moving Gesture Towards 2 Young Swifties",
        "description": "From sеlling storiеs to sеlling friеndship bracеlеts and prеmium apparеl, FOX sidеlinе rеportеr Erin Andrеws has quickly risеn from bеing a popular nеws curator to a succеssful еntrеprеnеur. Hеr brand, ‘WEAR by Erin Andrеws’, rеcеntly struck a major partnеrship dеal with one of thе most prominеnt figurеs in thе college football sеgmеnt, Dеion Sandеrs, for thеir…The post “This Is Freaking Adorable”: Deion Sanders’ “Troublesome” Business Partner Swoons Over Taylor Swift’s Moving Gesture Towards 2 Young Swifties appeared first on..."
    },
    {
        "title": "Taylor Swift Explained Why ‘”Slut!”‘ Was Cut From The Original ‘1989’ Album, And It Involves ‘Blank Space’",
        "description": "'\"Slut!\"' is one of the five 'From The Vault' tracks on '1989 (Taylor's Version).'"
    },
    {
        "title": "“We Are to Disappoint the Swifties” – Taylor Swift’s Fandom Turns to Soccer as Ryan Reynolds’ Wrexham Rivals’ Issue Statement",
        "description": "The collaboration between the soccer and entertainment industries has resulted in remarkable transformations. Fans, being the center of both industries, make it a win-win situation for both parties. However, it does not guarantee that your attempts will hit the target. In one such incident recently, American singer Taylor Swift’s reported attempt to get into a soccer venture…The post “We Are to Disappoint the Swifties” – Taylor Swift’s Fandom Turns to Soccer as Ryan Reynolds’ Wrexham Rivals’ Issue Statement appeared first on EssentiallySports."
    },
    {
        "title": "From country to pop, 2014 nostalgia to 2023 reality — it's time for Taylor Swift's '1989'",
        "description": "Taylor Swift’s reimagined “1989” is here, the album that ushered in the first Peak Swift era — revisited at the height of her massive pop culture dominance.Released…"
    },
    {
        "title": "TMZ: Taylor Swift Won't Attend Travis Kelce, Chiefs' Game vs. Broncos in Week 8",
        "description": "Travis Kelce will be left to his own devices when the Kansas City Chiefs play the Denver Broncos on Sunday. Per TMZ Sports, Taylor Swift won't be attending…"
    },
    {
        "title": "Taylor Swift to likely miss Travis Kelce’s Chiefs game this Sunday as ‘Eras Tour’ nears return: reports",
        "description": "Taylor Swift has appeared at multiple Kansas City Chiefs games this season, where the music star has been seen cheering on All-Pro tight end Travis Kelce. The Chiefs are traveling to Denver this weekend for matchup against the Broncos, but Swift is not expected to make the trip, according to multiple reports. She has been on break from her \"The Eras Tour\" for the past few months, but she will kick off the next leg of the world tour on November 9 in Argentina. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COMSwift will likely take some time for meetings and rehearsals as she prepares to go..."
    },
    {
        "title": "Taylor Swift and Jack Antonoff celebrate 'Cruel Summer' hitting No. 1 four years after initial release",
        "description": "Taylor Swift's latest milestone feels like a complete \"fever dream.\" On Monday, the singer and her collaborator Jack Antonoff celebrated their co-written song \"Cruel Summer,\" from the singer's 2019 album \"Lover,\" hitting No. 1 on Billboard's Hot 100 chart."
    },
    {
        "title": "Nikki Glaser Says She Spent $25K on Taylor Swift Concert Tickets",
        "description": "Nikki Glaser is proving she's the ultra Taylor Swift fan, shelling out big bucks for the pop star's concert tickets. The comedian appeared as a guest on \"The Kelly Clarkson Show\" Monday -- and admitted she anted up an eye-popping $25K for tickets…"
    },
    {
        "title": "Patrick Mahomes' mother gushes over Taylor Swift after pop star meets quarterback's little sister",
        "description": "The mother of Kansas City Chiefs quarterback Patrick Mahomes gushed over Taylor Swift on social media Monday as dating rumors between the pop star and Travis Kelce continue to heat up."
    },
    {
        "title": "O.J. Simpson Caught on Camera Accepting on Getting Turned On by Taylor Swift and Brittany Mahomes Handshake",
        "description": "There’s a popular handshake amongst two celebrities that is doing rounds on social media. It has caught the attention of the world and invited reactions from fans. Several analysts and pundits have joined in on the bandwagon with their breakdown regarding the same. It was a week full of interesting conversations surrounding the handshake. Celebrated…The post O.J. Simpson Caught on Camera Accepting on Getting Turned On by Taylor Swift and Brittany Mahomes Handshake appeared first on EssentiallySports."
    },
    {
        "title": "Sharing a Few Drops of Tears, Travis Kelce Reveals He Is Leading a ‘Safe Haven’ to Produce Taylor Swifts of Future",
        "description": "The Kansas City Chiefs players are shining bright. They are proudly celebrating with a stunning 6-1 record this season. The team has only been defeated once this year, and currently, they’re maintaining that record. The Chiefs are not only good at playing on-field, but they’re also a bunch of exemplary individuals. The team itself supports…The post Sharing a Few Drops of Tears, Travis Kelce Reveals He Is Leading a ‘Safe Haven’ to Produce Taylor Swifts of Future appeared first on EssentiallySports."
    },
    {
        "title": "Jack Black Stripped Down And Channeled His Inner ‘Anti-Hero’ For An Impromptu Taylor Swift Cover At A Fundraiser",
        "description": "Getty Image His fundraiser was benefitting striking workers in Hollywood."
    },
    {
        "title": "Taylor Swift Is Unbothered By ‘Slut!’ Labels On Her New ‘1989’ Vault Track",
        "description": "Over the years, her dating life has been the subject of much chatter."
    },
    {
        "title": "Taylor Swift’s Summer Was Far From Cruel As She’s Officially A Billionaire Now, And Here’s How She Did It",
        "description": "Getty Image 'You belong with me,' Taylor Swift says to all the money as 'Bloomberg' reports she's reached $1 billion."
    },
    {
        "title": "What Is Taylor Swift’s Net Worth?",
        "description": "Getty Image Not even the '1989' seagulls can fly within Taylor Swift's stratosphere."
    },
    {
        "title": "Patrick Mahomes wants to 'one-up' Taylor Swift and his wife's handshake with Travis Kelce",
        "description": "When Taylor Swift and Patrick Mahomes' wife went viral for their two handshakes, the quarterback realized he didn't have one with Travis Kelce."
    },
    {
        "title": "Taylor Swift Breaks All-Time Spotify Record Amid “1989 (Taylor’s Version)” Release",
        "description": "Taylor Swift’s incredible 2023 continues with a pair of new milestones. Fueled by the release of “1989 (Taylor’s Version)” and ongoing interest in her iconic discography, Swift on Friday broke the Spotify record for most single-day streams by an artist. The album itself, meanwhile, posted the largest single-day streaming count for an album in 2023. […]The post Taylor Swift Breaks All-Time Spotify Record Amid “1989 (Taylor’s Version)” Release appeared first on Headline Planet."
    },
    {
        "title": "With Taylor Swift in Attendance, Travis Kelce Records 179 Yards and Joins Legendary TE Shannon Sharpe",
        "description": "The Kansas City Chiefs are ruling the charts right now! At Arrowhead, the Chiefs defeated the Chargers 31–17 today! The Chargers put up a strong fight in the first half, so things were starting to become tight. However, the Chiefs turned things around in the second half and won the hard-fought battle in the end.…The post With Taylor Swift in Attendance, Travis Kelce Records 179 Yards and Joins Legendary TE Shannon Sharpe appeared first on EssentiallySports."
    },
    {
        "title": "‘She Switched From Heels to Tennis Shoes’: Travis Kelce and Taylor Swift’s First Public Kiss Picture Delights Many",
        "description": "Pop icon Taylor Swift and NFL star Kelce were spotted spending post-game with their close friends following the Kansas City Chiefs‘s victory against LA Chargers on Sunday at Arrowhead Stadium. Their friends ended up capturing a heartwarming moment. It seems the hottest NFL couple is taking new steps. What’s more, Kelce’s teammate’s GF posted a…The post ‘She Switched From Heels to Tennis Shoes’: Travis Kelce and Taylor Swift’s First Public Kiss Picture Delights Many appeared first on EssentiallySports."
    },
    {
        "title": "Will Travis Kelce Retire From NFL After the Current Season to Settle Down With Taylor Swift?",
        "description": "Travis Kelce isn’t just the freshest face on the NFL grid – he’s practically a seasoned veteran. But the attention this Kansas City Chiefs‘ star tight end has received since his Super Bowl performance is just baffling. You’d think he’s the league’s poster boy by now! Teaming up with the sensational QB Patrick Mahomes, Kelce…The post Will Travis Kelce Retire From NFL After the Current Season to Settle Down With Taylor Swift? appeared first on EssentiallySports."
    },
    {
        "title": "Peterborough residents fall victim to fake Taylor Swift concert tickets: police",
        "description": "The Peterborough Police Service says it has received four reports in recent weeks about the fraudulent sales of tickets for upcoming concerts by Taylor Swift."
    },
    {
        "title": "Is the Coverage on Taylor Swift and Travis Kelce’s Romance Nothing but Hype or a Pivotal Shift in NFL’s Century-Old Game Plan Towards Global Recognition?",
        "description": "The hardcore football fans are pretty much done with the NFL harping about Travis Kelce and Taylor Swift. Reality TV star Rachel Lindsay, a longtime NFL fan, recently slammed the “obnoxious” coverage, highlighting the “exhausting” uptick in Swifties obsessing over football. But that’s just one example of how fans are finding this fixation a little too…The post Is the Coverage on Taylor Swift and Travis Kelce’s Romance Nothing but Hype or a Pivotal Shift in NFL’s Century-Old Game Plan Towards Global Recognition? appeared first on EssentiallySports."
    },
    {
        "title": "“Within Next 3-5 Games”: Shannon Sharpe Issues “Elite” Prediction About Travis Kelce as Taylor Swift Continues Being His Lucky Charm",
        "description": "The Swift effect might swiftly alter Uncle Sharpe’s prized NFL possessions. The Hall of Fame tight end retains the top league records for the position, but Travis Kelce of the Kansas City Chiefs is rapidly approaching those milestones. Following Kelce’s outstanding performance on Sunday, with Taylor Swift among the spectators, Sharpe voiced his belief that…The post “Within Next 3-5 Games”: Shannon Sharpe Issues “Elite” Prediction About Travis Kelce as Taylor Swift Continues Being His Lucky Charm appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift Shares “Is It Over Now? (Taylor’s Version)” Lyric Video From the Vault",
        "description": "At midnight on October 27, Taylor Swift released the long-anticipated rerecording of her fifth studio album, 1989 (Taylor’s Version), and she’s adding some extra goodies along with the usual track listing. For instance, there are five tracks subtitled (From the Vault) that include “‘Slut!’,” “Say Don’t Go,” “Now That We Don’t Talk,” and “Suburban Legends.” […]The post Taylor Swift Shares “Is It Over Now? (Taylor’s Version)” Lyric Video From the Vault appeared first on American Songwriter..."
    },
    {
        "title": "Why Taylor Swift’s 'second-wave feminism' is a badly needed 'antidote' to Trumpism: journalist",
        "description": "On October 26, Bloomberg News reported that Taylor Swift had achieved billionaire status. The pop superstar had been a millionaire for a long time, but her Eras Tour has generated so much money that she is now officially a billionaire. Journalist Jill Lawrence, in an article published by the conservative website The Bulwark on October 27, praises Swift as a badly needed \"antidote\" to Trumpism who combines \"kindness\" with an \"iron will.\"\"Swift is the antidote we need, especially now,\" Lawrence argues. \"She shows young girls, women, and her many male fans that you can be a rich celebrity while..."
    },
    {
        "title": "Taylor Swift & Travis Kelce Hold Hands as They Leave Chiefs Game in New PDA Photo",
        "description": "Talk about endgame! After the Chiefs' victory over the Chargers, Taylor Swift and Travis Kelce were spotted walking hand-in-hand leaving Arrowhead Stadium."
    },
    {
        "title": "Taylor Swift fans worry after she spends time with Jackson Mahomes, Britney Spears shares why she goes nude",
        "description": "The Fox News Entertainment newsletter brings you the latest Hollywood headlines, celebrity interviews and stories from Los Angeles and beyond."
    },
    {
        "title": "How Taylor Swift Could Make History At The 2023 Billboard Music Awards",
        "description": "Swift — who is already the top female BBMAs recipient of all time — could surpass this artist to become the top overall leader."
    },
    {
        "title": "Josh Allen Rakes in the Fandom With His Unique LeBron James Calls; Fans Speculate He Mentioned ‘Taylor Swift’",
        "description": "The Buffalo Bills faced the Tampa Bay Buccaneers on Thursday Night Football. The Bills beat the Buccaneers tonight and claimed their 24-18 victory. The Buccaneers couldn’t score a single point in the first and the third quarter. During the match, there was something that caught everyone’s attention. Buffalo Bills’ star quarterback Josh Allen was already…The post Josh Allen Rakes in the Fandom With His Unique LeBron James Calls; Fans Speculate He Mentioned ‘Taylor Swift’ appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift Has Already Released A Deluxe Edition Of ‘1989 (Taylor’s Version)’ With A Kendrick Lamar Remix",
        "description": "Getty Image There's no bad blood between T-Swift and K.Dot."
    },
    {
        "title": "Taylor Swift’s ‘Is It Over Now?’ Vault Track Addresses Her Iconic Sad Boat Photo After Harry Styles Split",
        "description": "There's lyrical evidence that Taylor Swift's vault song 'Is It Over Now?' — and maybe the entire '1989' album — is about her relationship with Harry Styles."
    },
    {
        "title": "Taylor Swift Pens a Special Note as Travis Kelce and a Million Others Celebrate Her Emotional Album",
        "description": "It seems like Taylor Swift has finally got ‘that love’. The global pop icon successfully re-released her sixth album, which is the most dear to her. 1989, an album that marked the start of a legacy, with most of its tracks being on top charts globally. And on almost every individual’s playlist, is now revamped…The post Taylor Swift Pens a Special Note as Travis Kelce and a Million Others Celebrate Her Emotional Album appeared first on EssentiallySports."
    },
    {
        "title": "Travis Kelce prop bets for Chiefs vs. Broncos: Will Taylor Swift inspire another big game?",
        "description": "We have the best Travis Kelce player props from top sportsbooks, with Taylor Swift likely in attendance when the Chiefs take on the Broncos in NFL Week 8."
    },
    {
        "title": "“I Broke My Own Heart”: Taylor Swift Teases Things To Come By As Travis Kelce And Million Others Await Big Day",
        "description": "The 6-1 Kansas City Chiefs are on a roll as they grabbed yet another victory last week. The Chiefs’ defense remained strong in the last quarter of the game, which led their team to the 31-17 victory against the Los Angeles Chargers. Besides the strong defense, the Chiefs also have the support of the Tight…The post “I Broke My Own Heart”: Taylor Swift Teases Things To Come By As Travis Kelce And Million Others Await Big Day appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift fans speculate Harry Styles is 'lying traitor' she sings about on new song as wild theories circulate about her and Dianna Agron",
        "description": "The singer, 33, has dropped previously unreleased songs on the new version of her fifth album 1989 which took her career to new heights when it came out in 2014."
    },
    {
        "title": "FIRST KISS! Taylor Swift plants a smooch on boyfriend Travis Kelce in very loved up snap... after pop star watched him lead the Chiefs to victory in latest game against the Chargers",
        "description": "Taylor Swift and Travis Kelce have taken their relationship to the next level - posing for loved up snaps on Instagram."
    },
    {
        "title": "Why do people think Taylor Swift secretly wrote Henry Cavill’s new spy movie?",
        "description": "Photo: Axelle/Bauer-Griffin/FilmMagic It’s unclear whether Argylle author Elly Conway is even real Continue reading…"
    },
    {
        "title": "Ohio woman creates Taylor Swift pumpkin called the “Swiftkin”",
        "description": "For 35 years, Jeanette Paras has decorated pumpkins to look like celebrities. For her, the art is more than quirky fun. As a breast cancer survivor, Paras uses October to not only to celebrate Halloween, but to raise awareness for the disease.The post Ohio woman creates Taylor Swift pumpkin called the “Swiftkin” appeared first on KYMA."
    },
    {
        "title": "Question of the Day: Will Barbie or Taylor Swift Be More Popular this Halloween?",
        "description": "What Halloween costume do you think will be the most popular this year? Take our poll, sponsored by the gaming adventure app Cubieverse, and let us know if you think fans will be trick-or-treating as Barbie or Taylor Swift."
    },
    {
        "title": "We Didn’t Know We Needed A 399-Pound Pumpkin Painted Like Taylor Swift, But Now We Can’t Look Away",
        "description": "Getty Image And we need a petition for this 'Taylor SwiftKin' to be the Kansas City Chiefs' new mascot."
    },
    {
        "title": "Grimes was “doing Taylor Swift cosplay” when she wrote ‘California’",
        "description": "The track appeared on Grimes' 2015 album 'Art Angels' The post Grimes was “doing Taylor Swift cosplay” when she wrote ‘California’ appeared first on NME."
    },
    {
        "title": "Taylor Swift embraced by Travis Kelce's Kansas City Chiefs crew: 'She's letting her guard down,' expert says",
        "description": "Taylor Swift has been welcomed like \"family\" into Travis Kelce's Kansas City Chiefs crew, according to a body language expert who analyzed the pop star's moves with her new friends."
    },
    {
        "title": "From country to pop, 2014 nostalgia to 2023 reality — it's time for Taylor Swift's '1989'",
        "description": "From country to pop, 2014 nostalgia to 2023 reality — it's time for Taylor Swift's '1989'"
    },
    {
        "title": "Travis Kelce and Taylor Swift Together Script Billion-Dollar Worth Impact on American Economy, Global Sports",
        "description": "And she’s done it! After writing articles calling her a “$740 million celebrity” or “almost billionaire” singer-songwriter, Taylor Swift finally broke the $1,000,000,000 ceiling. Yeah, that’s 1 followed by 9 zeroes! But that’s with just the North American leg of her Eras Tour concert. In November she will take to the road, or should we say…The post Travis Kelce and Taylor Swift Together Script Billion-Dollar Worth Impact on American Economy, Global Sports appeared first on EssentiallySports."
    },
    {
        "title": "Watch: Jack Black Gives Impromptu, Nearly-Nude Performance of Taylor Swift Hit for SAG Fundraiser",
        "description": "When Jack Black covers Taylor Swift, he doesn’t just cover Taylor Swift. He strips down to his underpants, then he covers Taylor Swift. At a recent fundraising event benefiting those affected by the SAG-AFTRA strike work stoppages, Black took to the stage to sing a little bit from Swift’s hit “Anti-Hero” from her 2022 album […]The post Watch: Jack Black Gives Impromptu, Nearly-Nude Performance of Taylor Swift Hit for SAG Fundraiser appeared first on American Songwriter."
    },
    {
        "title": "Is Taylor Swift’s ‘Style’ About Harry Styles?",
        "description": "Getty Image Swift's re-recorded '1989 (Taylor's Version)' has fans thinking about the original songs and their subjects."
    },
    {
        "title": "Travis Kelce Reacts to Having Better NFL Stats with Taylor Swift in the Stands",
        "description": "Travis Kelce is weighing in on his game day stats when Taylor Swift is in the house. The topic came up on his “New Heights with Jason and Travis Kelce” podcast, when his brother Jason said, “As we all saw on social media, Taylor was in attendance and it is turning out it was good that she was in attendance because they put your stats up when she’s at the game and when she’s not at the game. I don’t know if you are aware of this but when T. Swift is at the game you are averaging 99 yards and when you are left with only your friends and remaining family there you are at 46.5 yards at..."
    },
    {
        "title": "Taylor Swift and Travis Kelce relationship works because ‘they’re very supportive of each other,’ his dad says",
        "description": "Taylor Swift will soon release her next re-recorded album, and Travis Kelce's dad will be in line to purchase as he boasted that the \"Cruel Summer\" singer is \"very genuine.\""
    },
    {
        "title": "Taylor Swift’s “1989 (Taylor’s Version)” Rockets To #1 On US iTunes Album Sales Chart",
        "description": "It was one of the year’s most anticipated releases, making its immediate impact the antithesis of surprising. Indeed, Taylor Swift’s “1989 (Taylor’s Version)” rocketed to #1 on the all-genre US iTunes album sales chart shortly after its release late Thursday/early Friday. It remains atop the chart as of 1:15AM ET Friday morning. The new release […]The post Taylor Swift’s “1989 (Taylor’s Version)” Rockets To #1 On US iTunes Album Sales Chart appeared first on Headline Planet."
    },
    {
        "title": "Did Taylor Swift Have Kendrick Lamar Re-Record His ‘Bad Blood’ Verse?",
        "description": "Getty Image The duo's sole collaboration was shared with the world in 2015."
    },
    {
        "title": "Taylor Swift Recalls Being 'Target of Slut Shaming' in 1989 TV Prologue, Addresses Rumors About Sexuality",
        "description": "Taylor Swift Recalls Being 'Target of Slut Shaming' in 1989 TV Prologue, Addresses Rumors About Sexuality"
    },
    {
        "title": "Taylor Swift reportedly just joined the billionaire's club, thanks to her Eras tour",
        "description": "Taylor Swift's net worth is now over $1 billion thanks to this summer's Eras world, Bloomberg reports. The news amid her concert film's box office success."
    },
    {
        "title": "Taylor Swift’s “1989 (Taylor’s Version)” Songs Form Entire Top 21 On US Spotify Streaming Chart, Top 17 On Global Chart",
        "description": "Dominant would be an understatement to explain how well Taylor Swift’s “1989 (Taylor’s Version)” fared on Spotify during its opening day. The 21 tracks from the album form the entire Top 21 on the US Spotify Streaming Chart for Friday, October 27. The album was nearly as commanding on the global chart, with songs claiming […]The post Taylor Swift’s “1989 (Taylor’s Version)” Songs Form Entire Top 21 On US Spotify Streaming Chart, Top 17 On Global Chart appeared first on Headline Planet."
    },
    {
        "title": "His Wife Blew Up At Hime For Not Supporting Her Obsession With Taylor Swift",
        "description": "Like many other women around the world, this man’s wife adores Taylor Swift. However, he feels like his wife supports her favorite musician a little bit too enthusiastically. Over the past year, Taylor Swift’s music is all that his wife listens to. While his wife works out or does household chores, her music is constantly […]"
    },
    {
        "title": "“Karma” Collaborators Taylor Swift, Ice Spice Connect At Tuesday’s MTV Video Music Awards",
        "description": "Earlier this year, Taylor Swift welcomed Ice Spice for a remix of her hit single “Karma.” They also performed the song at the MetLife Stadium stop of Swift’s “The Eras Tour.” Tuesday night, the artists connected at the MTV Video Music Awards. The two sat next to each other during the show, and photos from […]The post “Karma” Collaborators Taylor Swift, Ice Spice Connect At Tuesday’s MTV Video Music Awards appeared first on Headline Planet."
    },
    {
        "title": "Taylor Swift Extends 'The Eras Tour' to Indianapolis in 2024: A Musical Journey You Don't Want to Miss!",
        "description": "In a surprising twist, on Aug. 3 Taylor Swift took to her social media platforms to announce that The Eras Tour in 2023 was, in fact, not the end of an era. Instead, Taylor announced an extension of the tour into the fall of 2024! This extended tour will take place in North America—Miami, New […]The post Taylor Swift Extends 'The Eras Tour' to Indianapolis in 2024: A Musical Journey You Don't Want to Miss! appeared first on The DePauw."
    },
    {
        "title": "USA Today seeks ‘unbiased’ Taylor Swift beat reporter",
        "description": "Are you a Swiftie? Well do I NOT have a job for you. That’s right … Gannett Media announced a new job opportunity as a Taylor Swift reporter for The Tennessean and USA Today. But here’s the catch… you have to be an unbiased journalist. Who is the perfect candidate? Here’s what the job announcement Read more...The post USA Today seeks ‘unbiased’ Taylor Swift beat reporter appeared first on Awful Announcing."
    },
    {
        "title": "Travis Kelce, Taylor Swift have reportedly been spending time together",
        "description": "Travis Kelce is a big Taylor Swift fan, and the Kansas City Chiefs star said over the summer that he shamelessly tried to get Swift’s attention before one of her shows. It sounds like his persistence eventually paid off. During an episode of his “New Heights” podcast back in July, Kelce told his brother and...The post Travis Kelce, Taylor Swift have reportedly been spending time together appeared first on Larry Brown Sports."
    },
    {
        "title": "Taylor Swift’s ‘Cruel Summer’ Is One Space Shy Of Hitting No. 1…In Canada",
        "description": "“Cruel Summer” has now been held back from hitting No. 1 on the Canadian Hot 100 for two weeks by Doja Cat’s “Paint the Town Red.”"
    },
    {
        "title": "Edmonton Elks Labour Day Classic rematch to include Taylor Swift concert ticket giveaway",
        "description": "The Edmonton Elks are expecting over 30,000 people at Commonwealth Stadium Saturday when they give away two tickets to a Taylor Swift concert in Paris, France."
    },
    {
        "title": "Taylor Swift wins twice early at MTV VMAs as NSYNC reunites and Shakira delivers epic medley of hits",
        "description": "At the 2023 MTV Video Music Awards, surprises were many — and immediate. Within the first half-hour, the boy band NSYNC reunited on stage to present the first award for best pop video, which went to Taylor Swift. Lil Wayne and Olivia Rodrigo have opened the MTV Video Music Awards with a pair of high-energy performances. For the first time, only women are nominated in the show’s artist of the year category. Taylor Swift, Beyoncé, Doja Cat, Nicki Minaj, Karol G and Shakira are contenders for the night’s prize. Shakira received the Video Vanguard Award and performed a hip-..."
    },
    {
        "title": "Taylor Swift Plays With Asymmetrical Details in Versace Dress for MTV VMAs 2023",
        "description": "The singer is the most nominated performer of the night with a total of 11 nominations."
    },
    {
        "title": "Taylor Swift and her ‘Anti-Hero’ tops MTV VMAs in a show dominated by hip-hop, K-pop and Latin jams",
        "description": "Taylor Swift took home the top prize at the 2023 MTV Video Music Awards her “Anti-Hero” music video on a night full of surprises. Swift won four trophies on Tuesday's telecast, including song of the year, best pop video and best direction. As much as Swift dominated, the VMAs centered on music’s global power. K-pop boy band Tomorrow X Together and Brazilian superstar Anitta premiered their new collaboration, the glossy retro-pop of “Back for More.” Shakira delivered a packed medley of her hits and accepted the Video Vanguard Award, while Diddy performed with his..."
    },
    {
        "title": "The NFL may have wanted Taylor Swift for the Super Bowl halftime show. What they got instead was even better",
        "description": "The singer was rumored to be dating the Kansas City Chiefs’ Travis Kelce before she showed up to watch him in person, sitting next to his mom."
    },
    {
        "title": "Brett Griffin Calls Out Taylor Swift’s “Gold Digger” Boyfriend After Kansas City Wildfires",
        "description": "In a surprising turn of events, NASCAR insider Brett Griffin took to Twitter to share his candid thoughts about the rumored romance between Kansas City Chiefs’ tight end and global pop sensation Taylor Swift. Griffin’s tweet set the internet abuzz and ignited a wave of reactions from NASCAR fans. Rumors have swirled for some time…The post Brett Griffin Calls Out Taylor Swift’s “Gold Digger” Boyfriend After Kansas City Wildfires appeared first on EssentiallySports."
    },
    {
        "title": "Years Before Taylor Swift’s “Curse” Helped Heat, Jimmy Butler Danced to Travis Kelce’s Lover’s “22” Song",
        "description": "Basketball has had a long-standing connection with the world of music—especially hip-hop. From movies and advertisements to pre-game rituals, halftime entertainment, and post-game playlists, hip-hop’s influence on basketball is wide. Notably, some players have even ventured into it by releasing their albums. However, during the 2023 NBA playoffs, it appeared as though pop music was…The post Years Before Taylor Swift’s “Curse” Helped Heat, Jimmy Butler Danced to Travis Kelce’s Lover’s “22” Song appeared first on EssentiallySports."
    },
    {
        "title": "Travis Kelce Gushes Taylor Swift ‘Looked Amazing’ at the Chiefs Games Amid Romance Rumors",
        "description": "Travis Kelce calls Taylor Swift 'ballsy' for showing up to his Chiefs game and says everyone had 'nothing but great things to say about her.'"
    },
    {
        "title": "Travis Kelce’s Ex Seemingly Shades Taylor Swift After Self-Identifying as a ‘Girl’s Girl’",
        "description": "After a Sunday football game that played out like a Wattpad YA romance novel, Taylor Swift and Travis Kelce are reportedly very much still feeling things out. But that hasn’t stopped people like Kelce’s ex, life coach and influencer Maya Benberry, from talking. In a Tuesday interview with the Daily Mail, Benberry, who…Read more..."
    },
    {
        "title": "Days After Arrowhead Love Chapter, Will Taylor Swift Show Up at MetLife to Shout ‘LFG’ for Travis Kelce?",
        "description": "Taylor Swift was at the Arrowhead Stadium as the Kansas City Chiefs clashed with the Chicago Bears, and it was a showdown for the ages with the Chiefs dominating 41-10. Not only did the football fans witness some epic on-field action, but they also got a double dose of entertainment with Taylor Swift herself, who…The post Days After Arrowhead Love Chapter, Will Taylor Swift Show Up at MetLife to Shout ‘LFG’ for Travis Kelce? appeared first on EssentiallySports."
    },
    {
        "title": "Elle Duncan says Taylor Swift and Travis Kelce’s relationship is a ‘stunt’",
        "description": "Ever since rumblings of a relationship between Taylor Swift and Travis Kelce first made their way online, some people have been skeptical regarding the authenticity of the rumored romance. With “Traylor” mania currently at an all-time high following Swift’s presence at the Kansas City Chiefs’ win over the Chicago Bears on Sunday, ESPN’s Elle Duncan Read more...The post Elle Duncan says Taylor Swift and Travis Kelce’s relationship is a ‘stunt’ appeared first on Awful Announcing."
    },
    {
        "title": "EXCLUSIVE: Sophie Turner seen emerging from Taylor Swift's NYC home with daughters after actress and husband Joe Jonas agreed to keep children in state amid custody battle",
        "description": "Sophie Turner was spotted leaving Taylor Swift's New York City home as she navigates her messy divorce and custody battle with estranged husband Joe Jonas.   "
    },
    {
        "title": "Travis Kelce talked Taylor Swift on his podcast",
        "description": "Travis Kelce was already famous, but now he is learning what it means to be Taylor Swift-adjacent-famous."
    },
    {
        "title": "From country to pop, 2014 nostalgia to 2023 reality — it's time for Taylor Swift's '1989'",
        "description": "Taylor Swift’s reimagined “1989” is here, the album that ushered in the first Peak Swift era — revisited at the height of her massive pop culture dominance.Released…"
    },
    {
        "title": "TMZ: Taylor Swift Won't Attend Travis Kelce, Chiefs' Game vs. Broncos in Week 8",
        "description": "Travis Kelce will be left to his own devices when the Kansas City Chiefs play the Denver Broncos on Sunday. Per TMZ Sports, Taylor Swift won't be attending…"
    },
    {
        "title": "Broncos Blast Taylor Swift After Beating Chiefs In Elite Victory Lap",
        "description": "Travis Kelce and the Kansas City Chiefs’ offense was not at its best against the Denver Broncos on Sunday afternoon. And the Broncos did everything they could to make sure Kelce and his teammates wouldn’t be able to shake it off easily. Denver blasted the music of Kelce’s girlfriend, Taylor Swift, over the loud speaker […]"
    },
    {
        "title": "Travis Kelce’s Rival Team Uses Hilarious Taylor Swift Troll After Massive Upset on Sunday Night Football",
        "description": "In NFL Week 8, the Red Sea ventured into Colorado to compete against the Orange team. However, they lost on Sunday. The Denver Broncos secured a victory against the Kansas City Chiefs with massive points. However, that wasn’t enough to upset the Chiefs, as they playfully trolled Patrick Mahomes and his team, especially Travis Kelce…The post Travis Kelce’s Rival Team Uses Hilarious Taylor Swift Troll After Massive Upset on Sunday Night Football appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift & Brittany Mahomes: Inside Their Friendship Amid the Singer’s Romance With Travis Kelce",
        "description": "Neither of them is a cheer captain, but both have been on the bleachers rooting for their favorite Kansas City Chiefs players. "
    },
    {
        "title": "Babies dressed as Taylor Swift, Travis Kelce for hospital’s Halloween fun",
        "description": "INDIANAPOLIS (WISH) — Employees of the neonatal intensive care unit at Peyton Manning Children’s Hospital at Ascension St. Vincent showed off Halloween costumes of quadruplets on Monday. That, of course, included Taylor Swift eras and Travis Kelce, a tiny Harry Potter, and a Waldo. A social media post shared the photos of Harper, Bristol, Avery […]"
    },
    {
        "title": "Taylor Swift Breaks All-Time Spotify Record Amid “1989 (Taylor’s Version)” Release",
        "description": "Taylor Swift’s incredible 2023 continues with a pair of new milestones. Fueled by the release of “1989 (Taylor’s Version)” and ongoing interest in her iconic discography, Swift on Friday broke the Spotify record for most single-day streams by an artist. The album itself, meanwhile, posted the largest single-day streaming count for an album in 2023. […]The post Taylor Swift Breaks All-Time Spotify Record Amid “1989 (Taylor’s Version)” Release appeared first on Headline Planet."
    },
    {
        "title": "Liner Notes: Taylor Swift reminds us she’ll ‘never go out of style’ with ‘1989 (Taylor’s Version)’",
        "description": "If 2023 belongs to anyone, it is undoubtedly Taylor Swift. From her monumental Eras Tour to the re-release of her third studio album, “Speak Now,” and especially considering her recent Sunday Night Football appearances, Swift’s influence has broken through all facets of pop culture this year. Now, she’s reclaimed her ownership of another year: 1989....The post Liner Notes: Taylor Swift reminds us she’ll ‘never go out of style’ with ‘1989 (Taylor’s Version)’ appeared first on The Daily Northwestern."
    },
    {
        "title": "“Snake in the Grass”: Dave Portnoy Questions Travis Kelce’s Publicist Over Altered Taylor Swift Photo",
        "description": "Dropping one after the other mega controversy bomb, Dave Portnoy is ready again. The Barstool President who is known for his “controversial bravery,” found his interest around the NFL. His latest tweet stirred the conspicuous Kelce-Swift story yet again. This time he strikes at the Kansas City Chiefs’ Travis Kelce ‘s publicist for her Instagram…The post “Snake in the Grass”: Dave Portnoy Questions Travis Kelce’s Publicist Over Altered Taylor Swift Photo appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift Is Once Again No. 1 On The ‘Billboard’ Hot 100 And ‘1989 (Taylor’s Version)’ Hasn’t Even Hit The Charts Yet",
        "description": "Getty Image Taylor Swift, Doja Cat, SZA, and others top this week's 'Billboard' Hot 100 chart."
    },
    {
        "title": "Taylor Swift Caught in the Crossfire As Travis Kelce & Co’s Get ‘Kicked’ to the Curb by Skip Bayless",
        "description": "The pair of Travis Kelce and Taylor Swift are being targeted yet again ahead of the match between the Chiefs and the Broncos. Swift has been spotted at the Chiefs’ games several times this season. Coincidentally, the Kansas City Chiefs have been winning most of their games with Swift in the audience. Taylor Swift has…The post Taylor Swift Caught in the Crossfire As Travis Kelce & Co’s Get ‘Kicked’ to the Curb by Skip Bayless appeared first on EssentiallySports."
    },
    {
        "title": "“We Are to Disappoint the Swifties” – Taylor Swift’s Fandom Turns to Soccer as Ryan Reynolds’ Wrexham Rivals’ Issue Statement",
        "description": "The collaboration between the soccer and entertainment industries has resulted in remarkable transformations. Fans, being the center of both industries, make it a win-win situation for both parties. However, it does not guarantee that your attempts will hit the target. In one such incident recently, American singer Taylor Swift’s reported attempt to get into a soccer venture…The post “We Are to Disappoint the Swifties” – Taylor Swift’s Fandom Turns to Soccer as Ryan Reynolds’ Wrexham Rivals’ Issue Statement appeared first on EssentiallySports."
    },
    {
        "title": "Why Taylor Swift’s 'second-wave feminism' is a badly needed 'antidote' to Trumpism: journalist",
        "description": "On October 26, Bloomberg News reported that Taylor Swift had achieved billionaire status. The pop superstar had been a millionaire for a long time, but her Eras Tour has generated so much money that she is now officially a billionaire. Journalist Jill Lawrence, in an article published by the conservative website The Bulwark on October 27, praises Swift as a badly needed \"antidote\" to Trumpism who combines \"kindness\" with an \"iron will.\"\"Swift is the antidote we need, especially now,\" Lawrence argues. \"She shows young girls, women, and her many male fans that you can be a rich celebrity while..."
    },
    {
        "title": "Patrick Mahomes wants to 'one-up' Taylor Swift and his wife's handshake with Travis Kelce",
        "description": "When Taylor Swift and Patrick Mahomes' wife went viral for their two handshakes, the quarterback realized he didn't have one with Travis Kelce."
    },
    {
        "title": "Watch: Jack Black Gives Impromptu, Nearly-Nude Performance of Taylor Swift Hit for SAG Fundraiser",
        "description": "When Jack Black covers Taylor Swift, he doesn’t just cover Taylor Swift. He strips down to his underpants, then he covers Taylor Swift. At a recent fundraising event benefiting those affected by the SAG-AFTRA strike work stoppages, Black took to the stage to sing a little bit from Swift’s hit “Anti-Hero” from her 2022 album […]The post Watch: Jack Black Gives Impromptu, Nearly-Nude Performance of Taylor Swift Hit for SAG Fundraiser appeared first on American Songwriter."
    },
    {
        "title": "Taylor Swift’s “1989 (Taylor’s Version)” Songs Form Entire Top 21 On US Spotify Streaming Chart, Top 17 On Global Chart",
        "description": "Dominant would be an understatement to explain how well Taylor Swift’s “1989 (Taylor’s Version)” fared on Spotify during its opening day. The 21 tracks from the album form the entire Top 21 on the US Spotify Streaming Chart for Friday, October 27. The album was nearly as commanding on the global chart, with songs claiming […]The post Taylor Swift’s “1989 (Taylor’s Version)” Songs Form Entire Top 21 On US Spotify Streaming Chart, Top 17 On Global Chart appeared first on Headline Planet."
    },
    {
        "title": "Taylor Swift to likely miss Travis Kelce’s Chiefs game this Sunday as ‘Eras Tour’ nears return: reports",
        "description": "Taylor Swift has appeared at multiple Kansas City Chiefs games this season, where the music star has been seen cheering on All-Pro tight end Travis Kelce. The Chiefs are traveling to Denver this weekend for matchup against the Broncos, but Swift is not expected to make the trip, according to multiple reports. She has been on break from her \"The Eras Tour\" for the past few months, but she will kick off the next leg of the world tour on November 9 in Argentina. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COMSwift will likely take some time for meetings and rehearsals as she prepares to go..."
    },
    {
        "title": "Is Taylor Swift Attending Travis Kelce’s Next Kansas City Chiefs Game?",
        "description": "The football player and his team are set to play against the Denver Broncos at Empower Field at Mile High in Denver, CO on Sunday."
    },
    {
        "title": "Taylor Swift’s ‘Sweeter Than Fiction (Taylor’s Version)’ Is Getting The ‘Tangerine’ Treatment Thanks Her Target-Exclusive Vinyl Drop",
        "description": "Getty Image The singer's latest re-record, '1989 (Taylor's Version),' is out now."
    },
    {
        "title": "Taylor Swift’s Absence Hits Travis Kelce Really Hard, as NFL Broadcasters Highlight Chiefs’ TE Report Card",
        "description": "In a classic twist of fate, the Denver Broncos are turning the tables in a jaw-dropping showdown against the reigning champs, the Kansas City Chiefs. I mean, who saw this coming? With the Broncos at the bottom of the rankings and the Chiefs ruling the roost, it’s like witnessing a Hollywood underdog story right on…The post Taylor Swift’s Absence Hits Travis Kelce Really Hard, as NFL Broadcasters Highlight Chiefs’ TE Report Card appeared first on EssentiallySports."
    },
    {
        "title": "Taylor Swift Seemingly Nodded To The Infamous Kanye West VMAs Incident With An On-Stage Joke",
        "description": "Getty Image Fans think a Swift quip was a reference to the infamous moment."
    },
    {
        "title": "Taylor Swift’s ‘The Eras Tour’ Movie Prompted AMC, Wary Of A Ticketmaster-Style Mess, To Make Huge Ticketing System Upgrades",
        "description": "Karma's a relaxing thought for Taylor Swift, but not so much for Ticketmaster."
    },
    {
        "title": "Taylor Swift Announces Eras Tour Concert Film",
        "description": "Good news, Swifties! Taylor Swift has just announced that she’ll be releasing “Taylor Swift: The Eras Tour,” a concert film of her Eras tour. She wrote on her social media accounts, “The Eras Tour has been the most meaningful, electric experience of my life so far and I’m overjoyed to tell you that it’ll be coming to the big screen soon. Starting Oct 13th you’ll be able to experience the concert film in theaters in North America! Tickets are on sale now at amctheatres.com. Eras attire, friendship bracelets, singing and dancing encouraged… 1, 2, 3 LGB!!!! (iykyk).” Taylor also..."
    },
    {
        "title": "Taylor Swift enters her movie theater ‘Era’ as she brings record-breaking tour to the big screen",
        "description": "Taylor Swift is bringing her “Eras Tour” to a movie theater near you starting this October; the singer announced in an Instagram post Thursday morning.The post Taylor Swift enters her movie theater ‘Era’ as she brings record-breaking tour to the big screen appeared first on ABC7 Southwest Florida."
    },
    {
        "title": "Sabrina Carpenter Thinks Getting To Open Taylor Swift’s ‘The Eras Tour’ Is Full Circle And ‘So Special’",
        "description": "Getty Image She kicked off her first time opening in Mexico last night."
    },
    {
        "title": "‘Cruel Summer’ into fun fall: Taylor Swift concert movie coming in October",
        "description": "“Taylor Swift | The Eras Tour” will continue in movie theaters beginning in October"
    },
    {
        "title": "Exorswift: Taylor Swift concert film will open in theaters same day as new 'Exorcist' movie",
        "description": "A concert film of Taylor Swift's \"Eras Tour\" will hit theaters on October 13, going up against the release date of horror flick \"The Exorcist: Believer.\""
    },
    {
        "title": "Taylor Swift Announces an ‘Eras Tour’ Film and AMC Shares Soar",
        "description": "AMC Entertainment Holdings Inc. shares rise after pop star Taylor Swift announced that her recent “Eras Tour” will screen in North American cinemas starting in October."
    },
    {
        "title": "Missed out on Taylor Swift’s Eras Tour? Catch it in Canadian theatres",
        "description": "Taylor Swift is bringing her hugely popular Eras Tour to 150 Cineplex locations in Canada."
    },
    {
        "title": "Taylor Swift’s ‘The Eras Tour’ concert film is coming to movie theaters Oct. 13",
        "description": "The first three nights of Swift's six-evening run at SoFi Stadium in Inglewood in early August were recorded for the concert film."
    }
]